[
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": null, "recipe_link": "http://www.bbcgoodfood.com/recipes/category/healthy", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": null, "author": null, "preparation": [], "nutrition": {}, "desc": null},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Alex's mega brownies", "recipe_link": "http://www.bbcgoodfood.com/recipes/1129657/alexs-mega-brownies", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--554457_11.jpg?itok=8s0xPcgd", "author": "Good Food", "preparation": ["Heat oven to 180C/160C fan/gas 4 and line a 20cm square brownie tin with baking parchment. Beat the butter and sugar together with an electric whisk, then add the eggs one by one. Sift in the flour, cocoa powder and baking powder, and add the milk. Mix everything together, then stir in the chocolate chips. Spoon into the tin and level the top.", "Bake for 30 mins, or until the top is set, then cool completely. To make the topping, melt the milk chocolate, cool a little, then mix it with the soft cheese. Spread over the cooled brownies and cut into small squares – these are very rich."], "nutrition": {"salt": "164"}, "desc": "Ten-year-old Alex from London shares this recipe for easy, really rich brownies"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": null, "recipe_link": "http://www.bbcgoodfood.com/recipes/collection/chocolate-cake?page=1", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": null, "author": null, "preparation": [], "nutrition": {}, "desc": "We know you all love coffee cake as much as chocolate cake, so why not combine the two?"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": null, "recipe_link": "http://www.bbcgoodfood.com/recipes/collection/cheesecake?page=1", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": null, "author": null, "preparation": [], "nutrition": {}, "desc": "This fruity summer cheesecake can be part-prepared a day ahead"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "New York Cheesecake", "recipe_link": "http://www.bbcgoodfood.com/recipes/2869/new-york-cheesecake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--1001487_11.jpg?itok=rUW9cFzU", "author": "Good Food", "preparation": ["Position an oven shelf in the middle of the oven. Preheat the oven to fan 160C/conventional 180C/gas 4. Line the base of a 23cm springform cake tin with parchment paper. For the crust, melt the butter in a medium ", ". Stir in the biscuit crumbs and sugar so the mixture is evenly moistened. Press the mixture into the bottom of the pan and bake for 10 minutes. Cool on a ", " while preparing the filling.", "For the filling, increase the oven temperature to fan 200C/conventional 240C/gas 9. In a ", " fitted with the paddle attachment, beat the soft cheese at medium-low speed until creamy, about 2 minutes. With the mixer on low, gradually add the sugar, then the flour and a pinch of salt, scraping down the sides of the bowl and the paddle twice.", "Swap the paddle attachment for the whisk. Continue by adding the vanilla, lemon zest and juice. Whisk in the eggs and yolk, one at a time, scraping the bowl and whisk at least twice. Stir the 284ml carton of soured cream until smooth, then measure 200ml/7fl oz (just over 3⁄4 of the carton). Continue on low speed as you add the measured soured cream (reserve the rest). Whisk to blend, but don't over-beat. The batter should be smooth, light and somewhat airy.", " the sides of the springform tin with melted butter and put on a baking sheet. Pour in the filling - if there are any lumps, sink them using a knife - the top should be as smooth as possible. Bake for 10 minutes. Reduce oven temperature to fan 90C/conventional 110C/gas 1⁄4 and bake for 25 minutes more. If you gently shake the tin, the filling should have a slight wobble. Turn off the oven and open the oven door for a cheesecake that's creamy in the centre, or leave it closed if you prefer a drier texture. Let cool in the oven for 2 hours. The cheesecake may get a slight crack on top as it cools.", "Combine the reserved soured cream with the 142ml carton, the sugar and lemon juice for the topping. Spread over the cheesecake right to the edges. Cover loosely with foil and refrigerate for at least 8 hours or overnight.", "Run a round-bladed knife around the sides of the tin to loosen any stuck edges. Unlock the side, slide the cheesecake off the bottom of the tin onto a plate, then slide the parchment paper out from underneath."], "nutrition": {"salt": "549"}, "desc": "This cheesecake is heaven! I first made it for an after dinner treat for the family... And boy was this worth making.\nIt is time well worth spent, and worth making a day or so before your dinner guests... it is rich, creamy, and tasty on the taste buds, you will NEVER buy a ready made cheesecake ever again, if you do and compare - you will never match the texture, taste or tanginess of the lemon... A true beauty of a recipe! People will come to dinner hoping you've made this for desert?!!"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Chocolate caramel cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/11587/chocolate-caramel-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--363834_12.jpg?itok=Hx-5IRqO", "author": "Emma Lewis", "preparation": ["Heat oven to 180C/160C fan/gas 4. Lightly grease 2 x 23cm loose-bottom cake tins and line with a circle of baking parchment. Beat together the butter and sugar until pale and creamy. Add the eggs, one at a time, beating well between each addition, then add the baking powder, cocoa and a third of the flour. Mix well to combine, then stir in half the soured cream. Alternating between adding the flour and soured cream, mix everything until just combined. Spoon into the prepared tins, then smooth over the surface with a spoon.", "Bake for 30 mins or until the cakes are firm to touch and a skewer inserted into the centres comes out clean. Leave to cool in the tins for 5 mins, then turn out onto a rack and cool completely.", "When you’re ready to serve, whip the double cream with 2 tbsp Dulce de leche until soft peaks form. Place 1 cake on a serving plate and spread with half the cream, then drizzle over the remaining Dulce de leche. Top with the other cake, then spread the remaining cream on top. Sprinkle with the chocolate. Chill until ready to serve."], "nutrition": {"salt": "597"}, "desc": "This rich cake makes an impressive centrepiece for any summer tea party"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Fudgy dark chocolate cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/2005/fudgy-dark-chocolate-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--364184_10.jpg?itok=eWj2NFNK", "author": "Good Food", "preparation": ["Heat oven to 190C/fan 170C/gas 5. Butter two 20cm sandwich tins and line with non-stick baking paper. In a large bowl, beat all the cake ingredients together until you have a smooth, soft batter.", "Divide the mixture between the tins, smooth the surface with a spatula or the back of a spoon, then bake for about 20 mins until golden and the cake springs back when pressed. Turn onto a cooling rack and leave to cool completely.", "For the fudge frosting, heat the cream until it just begins to boil. Take off the heat and add butter, honey and chocolate (broken into pieces).", "Leave to melt for 5 mins, then stir briefly to combine - don't over-mix or it will lose its shine. Sandwich the cakes with a third of the just-warm frosting and spread the rest over the top and sides. Top with shaved or grated chocolate, if you like."], "nutrition": {"salt": "548"}, "desc": "Fudgy dark chocolate sponge, the perfect party cake, afternoon-tea cake or any-excuse cake"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": null, "recipe_link": "http://www.bbcgoodfood.com/recipes/collection/brownie?page=1", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": null, "author": null, "preparation": [], "nutrition": {}, "desc": "Rich chocolate brownies with a light, carrot cake-style orange topping"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": null, "recipe_link": "http://www.bbcgoodfood.com/recipes/collection/kids-party?page=1", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": null, "author": null, "preparation": [], "nutrition": {}, "desc": "When the weather is warmer, bring some sunshine flavours into everyone’s favourite afternoon tea and picnic snack"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": null, "recipe_link": "http://www.bbcgoodfood.com/recipes/collection/under-20-minutes?page=1", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": null, "author": null, "preparation": [], "nutrition": {}, "desc": "Superhealthy - good source of omega-3s"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Frosted carrot squares", "recipe_link": "http://www.bbcgoodfood.com/recipes/775662/frosted-carrot-squares", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--489452_11.jpg?itok=TL60g-pG", "author": "Good Food", "preparation": ["Line an 18cm square tin with baking parchment. ", " to turn the oven on to 180C/160C fan/gas 4. Grate the carrots on the fine side of the grater, then tip them into a large bowl.", "Sift the sugar, flour, bicarb and cinnamon on top of the carrot, then add the orange zest and mix everything around a bit.", "Break the eggs into a bowl (scoop out any bits of shell), then add them to the bowl along with the oil. Mix everything together well.", "Scoop the cake mix into your tin and level the top. ", " to put it in the oven for 30 minutes or until the cake is cooked. Cool.", "To make the icing, mix the butter and icing sugar together, then stir in the soft cheese until smooth.", "When the cake is cool, spread the top with the icing and cut into squares. Decorate with sprinkles, if you like."], "nutrition": {"salt": "665"}, "desc": "Get kids aged 8-14 busy in the kitchen this weekend, making this classic teatime treat"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "20-minute pork pan-fry", "recipe_link": "http://www.bbcgoodfood.com/recipes/3078/20minute-pork-panfry", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--4491_12.jpg?itok=rxoin0l7", "author": "Good Food", "preparation": ["Coat the pork: Cut the pork diagonally into finger-thick slices. Tip the flour and rosemary into a large plastic food bag, add some salt and pepper and the pork, and toss until the meat is well coated.", "Start cooking: Heat 2 tablespoons of the oil in a large wide frying pan. Add the pork and fry for about 3-4 minutes until nicely browned on both sides, turning once. Remove from the pan.", "Fry the mushrooms: Heat the remaining oil in the pan, tip in the mushrooms and fry until they start to soften, about 2 minutes. Sprinkle in the garlic and return the pork to the pan with any flour left in the bag. Stir in the stock and bring to the boil. Simmer for 5 minutes or until the pork is cooked."], "nutrition": {"salt": "288"}, "desc": "Comfort food at its best"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Cheeseburger & chips", "recipe_link": "http://www.bbcgoodfood.com/recipes/12230/cheeseburger-and-chips", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--424775_12.jpg?itok=DKChALXF", "author": "Good Food", "preparation": ["Tip the mince into a large bowl with the onion, breadcrumbs, cheese, parsley, Worcestershire sauce, egg, chilli powder, ½ tsp salt and some pepper. Mix together well with your hands, then divide the mixture into 10 and shape into burgers.", "Bring 2 large saucepans of water to the boil (or prepare the chips in batches if you don’t have enough big pans). Add the chips, bring the water back to the boil and set your timer for 3 mins. After 3 mins, drain the potatoes well and tip onto one or two large kitchen-papercovered trays. Scatter with the flour and some seasoning and gently toss to coat.", "Freeze the burgers and chips (see freezing tips, below) or, to cook straight away, heat oven to 200C/180C fan/gas 6. In a baking tray, toss the chips in a little oil, then roast for 35-40 mins until crisp and golden. Meanwhile, heat a griddle pan, grill or barbecue until hot, then cook the burgers for about 5-8 mins on each side, or until cooked to your liking. Sandwich the burgers in toasted buns with salad and sauces, then serve with the chips."], "nutrition": {"salt": "558"}, "desc": "Homemade burgers and chips beat shop-bought every time. Why not make double and freeze a batch?"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Elderflower crunch cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/693645/elderflower-crunch-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--358495_12.jpg?itok=6PlQYjX-", "author": "Sarah Cook", "preparation": ["Heat oven to 160C/140C fan/gas 3. Grease and line a 2lb/900g loaf tin with a long strip of baking parchment. To make the loaf cake batter, beat the butter and sugar with an electric whisk until light and fluffy. Beat in the eggs, flour, almonds, baking powder and milk until smooth. Pour into the tin and bake for 45-50 mins until golden, risen and a skewer poked in the centre comes out clean.", "As soon as the cake has come out of the oven, prick it all over with a skewer. Mix together the cordial and extra sugar, then pour all over the cake. Cool in the tin, then carefully lift out to slice."], "nutrition": {"salt": "463"}, "desc": "Capture the essence of summer in this simple loaf cake with elderflower drizzle"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Chocolate fudge cupcakes", "recipe_link": "http://www.bbcgoodfood.com/recipes/470642/chocolate-fudge-cupcakes", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--256531_11.jpg?itok=C0j9ZEnN", "author": "Sarah Cook", "preparation": ["Heat oven to 160C/140C fan/gas 3 and line a 12-hole muffin tin with cases. Gently melt the butter, chocolate, sugar and 100ml hot water together in a large saucepan, stirring occasionally, then set aside to cool a little while you weigh the other ingredients.", "Stir the eggs and vanilla into the chocolate mixture. Put the flour into a large mixing bowl, then stir in the chocolate mixture until smooth. Spoon into cases until just over three-quarters full (you may have a little mixture leftover), then set aside for 5 mins before putting on a low shelf in the oven and baking for 20-22 mins. Leave to cool.", "For the icing, melt the chocolate in a heatproof bowl over a pan of barely simmering water. Once melted, turn off the heat, stir in the double cream and sift in the icing sugar. When spreadable, top each cake with some and decorate with your favourite sprinkles and sweets."], "nutrition": {"salt": "505"}, "desc": "These bright and fun cupcakes are perfect for kids' parties"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Double chocolate loaf cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/694633/double-chocolate-loaf-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--363957_11.jpg?itok=kL4aGTZv", "author": "Sarah Cook", "preparation": ["Heat oven to 160C/140C fan/gas 3. Grease and line a 2lb/900g loaf tin with a long strip of baking parchment. To make the loaf cake batter, beat the butter and sugar with an electric whisk until light and fluffy. Beat in the eggs, flour, almonds, baking powder, milk and cocoa until smooth. Stir in the chocolate chips, then scrape into the tin. Bake for 45-50 mins until golden, risen and a skewer poked in the centre comes out clean.", "Cool in the tin, then lift out onto a wire rack over some kitchen paper. Melt the extra chocolate chunks separately in pans over barely simmering water, or in bowls in the microwave, then use a spoon to drizzle each in turn over the cake. Leave to set before slicing."], "nutrition": {"salt": "504"}, "desc": "Chocolate and cake are two of our favourite things, so what's not to love about this indulgent cake?"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Prawn cocktail", "recipe_link": "http://www.bbcgoodfood.com/recipes/711652/the-ultimate-makeover-prawn-cocktail", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--359494_11.jpg?itok=8Lw9ZuwN", "author": "Angela Nilsen", "preparation": ["Peel the prawns. Rinse them in a large sieve under a cold tap, then pat dry with kitchen paper. Lay the prawns in a shallow dish and squeeze over 1 tbsp of the lime juice, then add a twist of pepper. Set aside.", "Chop the cucumber into small dice and tip into a dish. Spoon over the vinegar, scatter over the dill and a grating of pepper, then set aside. Halve, stone and peel the avocado, then chop into small dice. Spoon over the rest of the lime juice and toss together gently with a twist of pepper.", "For the sauce, mix together the mayonnaise, fromage frais and ketchup. Stir in the Tabasco, Worcestershire and brandy with a twist of pepper.", "To serve, put a small spoonful of the sauce into the bottom of each cocktail glass. Very coarsely chop most of the watercress, leaving a few sprigs whole. Lay the chopped watercress on top of the sauce. Drain the cucumber well, then spoon it over the watercress with the avocado. Pile over the prawns, then spoon over the rest of the sauce. Tuck in the sprigs of watercress and serve with a sprinkling of cayenne."], "nutrition": {"salt": "186"}, "desc": "Try a lighter, modern version of this ever-popular retro starter"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": null, "recipe_link": "http://www.bbcgoodfood.com/recipes/collection/ultimate-makeover?page=1", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": null, "author": null, "preparation": [], "nutrition": {}, "desc": "Angela Nilsen has created a lighter, yet still chocolatey cookie with just 97 calories per biscuit"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Vanilla ice cream", "recipe_link": "http://www.bbcgoodfood.com/recipes/6601/the-ultimate-makeover-vanilla-ice-cream", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--560787_11.jpg?itok=9P1bRMwv", "author": "Angela Nilsen", "preparation": ["Freeze the canister from the ice-cream machine a day before you make the ice cream (if your machine requires you to). Next day, mix the sugar, custard powder and cornflour with 2 tbsp milk to make a thin paste. Beat in egg yolks. Pour the rest of the milk into a pan, scrape in the vanilla seeds, add the pod, then bring to the boil. Pour this slowly over the cornflour mix, stirring all the time as you do so. Clean the pan, then pour the milk mixture and vanilla pod back into it. Cook over a medium heat, stirring all the time, until it just comes to the boil and is thick enough to coat the back of a spoon.", "Remove from the heat, stir in the crème fraîche, then pour into a bowl. Place a piece of greaseproof paper over the surface to prevent a skin forming, then leave to cool. Put into the fridge until really cold for at least 4-5 hrs (preferably overnight).", "Remove the paper and vanilla pod from the custard, then transfer the custard into a jug. Turn on the ice cream machine, then slowly pour in the custard. Leave to churn for 10-30 mins (depending on your machine). When it stops, spoon into a plastic container, cover with cling film and a lid, then freeze for at least 3-4 hrs. (Will keep for up to 1 month. Do not re-freeze.) For the best taste, remove from the freezer and soften in the fridge for 1-1½ hrs before serving. Serve with fresh fruit."], "nutrition": {"salt": "148"}, "desc": "Angela Nilsen creates a luscious ice cream that is creamy, fresh and - wait for it.... low-fat!"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Chocolate log", "recipe_link": "http://www.bbcgoodfood.com/recipes/164609/the-ultimate-makeover-chocolate-log", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--363746_11.jpg?itok=hgzgtk1Q", "author": "Angela Nilsen", "preparation": ["Heat oven to 190C/170C fan/gas 5. Lightly oil and line a 23 x 32cm Swiss roll tin with baking paper. Mix the coffee with 1 tbsp warm water. Beat the eggs, both sugars and the coffee mix together in a large mixing bowl with an electric whisk for about 8 mins or until the mixture is thick and airy like meringue and holds a trail when you lift up the beaters.", "Sift the flour and cocoa powder over the fluffy egg mix, then fold in very gently using a large metal spoon. Pour the mixture evenly into the lined tin and carefully tip it so it spreads evenly without being deflated. Use a knife if necessary to very gently tease it into the corners. Bake for 12-15 mins or until the cake feels spongy but firm when touched.", "Lay a sheet of baking paper on the work surface and sprinkle with a little caster sugar. Tip the tin upside-down onto the paper and let the cake fall out. Carefully peel off the paper. Roll up the cake lengthways from one of the short ends with the help of the paper, rolling it inside so the cake doesn’t stick. Cool. The cake becomes even more moist if left overnight wrapped up, then iced the next day.", "For the chocolate icing, put the chopped chocolate in a medium bowl. Heat a small pan of water (one-third full) until boiling, remove it from the heat, then sit the bowl of chocolate over the top. Leave for a few mins off the heat until melted. Remove the bowl from the pan, then leave the chocolate until it is cool to the touch. Beat the mascarpone and quark together, then sift and stir in the icing sugar and cocoa powder. Stir in the cooled melted chocolate (keeping a couple of tsp back for drizzling), then the coffee mixed with the vanilla extract.", "Carefully unroll the cake, don’t worry if it cracks a bit, and discard the paper. Spread half the icing over the unrolled cake, then re-roll it, finishing with the join underneath. Place the cake on a serving plate. Swirl the rest of the icing all over the cake to cover it, then drizzle over the reserved melted chocolate. Decorate with a sprig of holly."], "nutrition": {"salt": "271"}, "desc": "The lighter version of this much-loved festive treat keeps all of the chocolatey richness"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Carrot cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/7900/the-ultimate-makeover-carrot-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--1081487_12.jpg?itok=GAUkuxwo", "author": "Angela Nilsen", "preparation": ["Heat oven to 160C/fan 140C/gas 3. For the cake, finely grate the zest from the orange and squeeze 3 tbsp of juice. Pour the juice over the raisins in a bowl, stir in zest, then leave to soak while you make the cake. Lightly oil and line the base of a deep 20cm square cake tin. Mix the flours with 1 tsp baking powder, bicarbonate of soda and cinnamon.", "Separate one of the eggs. Put the white in a small bowl and the yolk in a large one. Break the remaining whole egg in with the yolk, then tip in the sugar. Whisk together for 1-2 mins until thick and foamy. Slowly pour in the oil and continue to whisk on a low speed until well mixed. Tip in the flour mix, half at a time, and gently stir it into the egg mixture with a rubber spatula or big spoon. The mix will be quite stiff. Put the extra pinch of baking powder in with the egg white and whisk to soft peaks.", "Fold the carrot, raisins (and any liquid) into the flour mixture. Gently fold in the whisked egg white, then pour into the tin. Jiggle the tin to level the mixture. Bake for 1 hr until risen and firm or until a skewer inserted in the centre comes out clean. Leave to cool in the tin 5 mins, turn out onto a wire rack, peel off the paper, then leave until cold.", "To make the frosting, stir the soft cheese, Quark, icing sugar and orange zest together - don't overbeat. Stir in the lemon juice. Swirl the frosting over the cake and cut into 16 square. This cake is even better if left well wrapped for a day or two before icing and eating. Will keep up to 5 days uniced in an airtight tin, or in the fridge if iced."], "nutrition": {"salt": "9g", "kcal": "217"}, "desc": "Angela Nilsen rethinks traditional ingredients and baking techniques to create a healthier version of a classic"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Coffee walnut cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/12393/the-ultimate-makeover-coffee-walnut-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--1273557_8.jpg?itok=eNpr-z1j", "author": "Angela Nilsen", "preparation": ["Heat oven to 180C/160C fan/gas 4. Oil and bottom-line a 20cm round (6cm deep) loose-bottom tin. For the cake, mix the coffee with 2 tsp warm water and set aside. Tip the flour into a large mixing bowl. Stir in the baking powder, ground almonds, both sugars (use fingers to rub out any lumps from the muscovado) and walnuts, then make a dip in the centre. Put the eggs, yogurt, oil and coffee mix into the dip and stir the mixture with a wooden spoon so everything is evenly mixed. Spoon the mixture into the tin, smooth the top to level it, then bake for 40-45 mins, or until a skewer inserted into the centre of the cake comes out clean. Let the cake cool in the tin briefly, then turn it out and peel off the lining paper. Leave to cool completely while you make the filling and icing.", "Make the syrup for the filling: put the caster sugar and coffee into a small, heavy-based saucepan, then pour in 3 tbsp water. Heat gently, stirring to help the sugar dissolve. Once dissolved, raise the heat, then boil at a fast rolling boil for about 2½-3 mins until thickened and syrupy. Pour into a small heatproof bowl and set aside to cool. When cold it should be the consistency of treacle.", "Meanwhile, finish off the filling and make the icing. Beat the mascarpone, quark, icing sugar and vanilla together until smooth, then stir in the cold coffee syrup. Set aside. For the icing, sift the fondant icing sugar into a bowl. Mix the coffee with 1 tbsp warm water, stir this into the fondant icing sugar with about 1 more tsp water to give a smooth, thick but spreadable icing. Split the cake into 3, then sandwich back together with the filling. Spread the icing over the top, scatter over the chopped walnuts and leave to set. Store in the fridge."], "nutrition": {"salt": "336"}, "desc": "A delicious but lighter version of teatime favourite, coffee and walnut cake"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Macaroni cheese", "recipe_link": "http://www.bbcgoodfood.com/recipes/252622/the-ultimate-makeover-macaroni-cheese", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--337549_11.jpg?itok=us9qWSO8", "author": "Angela Nilsen", "preparation": ["Mix 3 tbsp of milk with the cornflour and mustard, set aside. Heat the rest of the milk with the garlic until just coming to boil. Remove from the heat, sprinkle in the crushed chillies and leave to infuse.", "Get everything else ready. Coarsely grate both cheeses, keeping them separate. Mix a handful of the cheddar into the breadcrumbs with a grinding of pepper. Thickly slice the medium tomatoes and halve the cherry. Finely slice the spring onions. Heat oven to 190C/fan 170C/gas 5.", "Bring a pan of water up to the boil, tip in the macaroni, give it a stir so it doesn’t stick, then cook for 6 mins, stirring occasionally. Stir in the spring onions and cook for another 2 mins. Meanwhile, make the sauce. Stir the cornflour mix into the warm milk. Return the pan to the heat, then bring to the boil, stirring, until thickened and smooth. Remove from the heat and stir in the Parmesan, most of the remaining cheddar and some pepper to taste. Stir in the buttermilk.", "Tip the macaroni into a colander, drain, then hold under a very hot tap to keep it all separate. Drain well, then stir into the sauce. Pour into an ovenproof dish, about 30 x 20 x 5.5cm deep. Lay the tomatoes over the top then scatter over the cheesy breadcrumbs, the rest of the cheese and a grating of pepper. Bake for about 15 mins until starting to bubble around the edges. Grill for about 5 mins until the top is crisp and well browned. Let sit for a few mins to settle before serving."], "nutrition": {"salt": "503"}, "desc": "A lighter version of this favourite comfort food dish, that doesn't compromise on flavour"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Sponge pudding & custard", "recipe_link": "http://www.bbcgoodfood.com/recipes/8034/the-ultimate-makeover-sponge-pudding-and-custard", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--484555_11.jpg?itok=iwUccmBG", "author": "Angela Nilsen", "preparation": ["Very lightly butter a 1-litre pudding basin. Heat oven to 180C/fan 160C/gas 4. Coarsely grate one of the apple quarters and thinly slice the rest. Combine the sliced apple and blackberries, toss with the 2 tbsp caster sugar and spoon half into the bottom of the basin.", "Mix together the flour and baking powder. Beat both the sugars and butter together in a large bowl with an electric hand beater until light and creamy. Break in 1 egg and beat well, then beat in the second egg (the mix will look curdled). Sift half the flour mixture over the sponge mixture and fold in gently. Carefully stir in half the milk, then repeat with the rest of the flour and milk, followed by the orange zest and reserved grated apple.", "Spoon two-thirds of the sponge mixture over the fruit mix in the basin and level off. Spread the rest of the fruit on top, followed by the remaining sponge mix. Place the basin in a small roasting tin half filled with hot water. Bake for 1¼ hrs (lay foil over the top for the last 15 mins if it is browning too quickly) until a skewer inserted in the middle comes out clean.", "While the pudding is baking, make the custard. Mix the sugar, custard powder and cornflour with 1 tbsp of the milk to make a paste. Beat in the egg yolk. Pour the remaining milk into a pan, slit the vanilla pod lengthways and scrape in the vanilla seeds. Add the pod to the milk and bring just to the boil. Pour this over the cornflour mix, stir, then pour into a clean pan. Cook over a medium heat, stirring all the time, until it is thick enough to coat the back of a spoon. Remove from the heat and stir in the crème fraîche.", "Loosen pudding from the sides of the basin with a round-bladed knife and carefully invert it onto a serving plate. Serve with the custard."], "nutrition": {"salt": "318"}, "desc": "Angela's pud has half the fat of the classic recipe, but all the flavour, with a layer of seasonal fruit"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Blueberry muffins", "recipe_link": "http://www.bbcgoodfood.com/recipes/359605/the-ultimate-makeover-blueberry-muffins", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--337557_11.jpg?itok=iVt3bjhF", "author": "Angela Nilsen", "preparation": ["Heat oven to 200C/180C fan/gas 6. Use 1 tsp oil to lightly oil a 12-hole muffin tin (or use paper cases). Mix both flours with the baking powder and lemon zest. Reserve 1 tbsp caster sugar, then stir the rest into the flour with the muscovado.", "Mash the banana well. In another bowl beat the egg, then stir in the banana, buttermilk and oil. Using a large metal spoon, very lightly stir into the flour mix, just to combine. Over-mixing will make the muffins tough. Toss in the blueberries and give just a few turns of the spoon to carefully stir them in without crushing.", "Spoon the mixture into the tin – each hole should be very full. Bake for 20-25 mins until risen and golden.", "Mix the reserved caster sugar with the lemon juice. When the muffins are done, remove from the oven, then brush with the sugar and lemon mixture while they are still hot. Gently loosen the edges of each muffin with a knife, then leave in the tin for 15 mins to cool a little as they’re very delicate while hot. Remove to a wire rack. Best eaten the day of making, but will keep for up to 2 days."], "nutrition": {"salt": "6g", "fat": "206"}, "desc": "We've created a deliciously light version of this classic muffin that contains virtually no saturated fat"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Coronation chicken", "recipe_link": "http://www.bbcgoodfood.com/recipes/532644/the-ultimate-makeover-coronation-chicken", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--337570_11.jpg?itok=W5cPssMa", "author": "Angela Nilsen", "preparation": ["Put the chicken in a large pan, then pour in enough cold water to just cover. Roughly chop one of the onions, drop into the pan with the carrot, tarragon and bay leaves. Cover, bring to the boil, then lower to a gentle simmer for about 1 ¾ hrs or until the chicken is cooked (the legs will fall easily away from the body). Remove from the heat, but leave the chicken in the liquid to cool for about 3 hrs. When cold, lift the chicken out of the stock then strain (skim off any fat from the stock) and keep 200ml for the sauce. Can be done a day ahead and chilled. The excess stock can be chilled the frozen.", "Finely chop the second onion. Heat oil in a small saucepan, tip in the onion and fry until softened and pale golden, about 5-8 mins. Stir in the curry powder and cook for 1 min, stirring. Pour in the reserved chicken stock, then stir in the tomato purée. Cover and simmer for 10 mins. At the same time, put the apricots in a small pan with enough water to just cover them, then simmer for 15 mins. Drain, reserving 1 tbsp of the liquid. Purée the apricots in a small blender with the reserved liquid then press through a sieve (you should get about 1 tbsp purée). Remove curry sauce from the heat then stir in the sugar. Strain through a sieve, pressing as much through as you can with a wooden spoon, then stir in the lime juice and apricot purée and leave until cold.", "Mix together the mayonnaise and fromage frais, then stir in the cold curry sauce. Season to taste with a good grinding of pepper.", "Cut the spring onions into long, slim slivers, then set aside. If you want them to curl, put into a bowl of iced water while you finish the salad. Remove the skin from the chicken. Strip the meat off the bones in chunky pieces, remove the breasts separately and thickly slice. Gently toss the chicken with the curried sauce, the coriander and most of the mango. Scatter the watercress onto a platter. Spoon the chicken mix on top, tuck in the rest of the mango and finish with a pile of (drained) spring onions."], "nutrition": {"salt": "402"}, "desc": "Discover a lighter, prettier version of this popular salad from our Ultimate Makeover collection, with half the fat but loads more flavour"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Steak & kidney pie", "recipe_link": "http://www.bbcgoodfood.com/recipes/13015/the-ultimate-makeover-steak-and-kidney-pie", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--484486_11.jpg?itok=PSVOHk3C", "author": "Angela Nilsen", "preparation": ["Cut out and discard the thin tubes from the kidneys. Rinse the kidneys in cold water until the water runs clear, then chop them into small pieces. Heat the oil in a large saucepan or deep sauté pan. Add the onions, bay and thyme sprigs and fry over a medium heat for 8-10 mins until the onions are really golden, stirring often. Put the kettle on.", "Add the steak and kidney to the pan and stir-fry briefly, just until it loses its pink colour. Turn up the heat, pour in the wine, stir to deglaze the bottom of the pan, then let it boil over a high heat for 2-3 mins until reduced and absorbed into the meat. Stir in the tomato purée and mustard powder. Sift in the flour, stirring, then stir for a couple of mins. Pour in 400ml boiling water and continue stirring until the mixture starts to boil and is thickened. Tip in the carrot and both mushrooms, reduce the heat, cover with a lid, then leave to simmer gently for about 1 hr, stirring occasionally. Remove the lid and simmer another 25-30 mins or until the meat is very tender and the gravy has thickened slightly.", "Remove from the heat and remove the bay leaves and thyme sprigs. Stir in the parsley, season to taste, then transfer to a pie or ovenproof dish (22-23cm in diameter, 6cm deep, 1.7-litre capacity or similar), then leave to cool slightly. Heat oven to 200C/180C fan/gas 6.", "While the meat is cooling, make the pastry. Put the flour, and thyme if using, into a bowl. Grate in the cold or frozen butter, make a well in the centre, then add the yogurt, olive oil, a pinch of salt and a good grinding of black pepper. Using a round-bladed knife, mix together with 2 tsp cold water, then gently gather together with your hands to form a dough. Remove from the bowl and knead briefly until smooth.", "Roll out the pastry on a lightly floured surface so it’s slightly bigger than the top of the pie dish. Lay the pastry over the meat and trim the edges with scissors so it slightly overhangs the edge of the dish. Make 2 small slits in the centre. Flute the edges, then roll out the trimmings and cut out 6 diamond-shaped leaves. Dampen one side and lay them on the pastry lid. Place the dish on a baking sheet, then bake in the oven for about 25 mins or until the pastry is golden."], "nutrition": {"salt": "373"}, "desc": "The ultimate comfort dish gets a superhealthy makeover"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Blueberry trifle", "recipe_link": "http://www.bbcgoodfood.com/recipes/10995/the-ultimate-makeover-blueberry-trifle", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--337526_12.jpg?itok=8rUnH2wg", "author": "Angela Nilsen", "preparation": ["Make the custard: blend the sugar, custard powder and cornflour with 1 tbsp milk to make a runny paste. Beat in the egg yolk. Pour the remaining milk into a pan, scrape in the vanilla seeds, add the pod, then allow to come just to the boil. Stir this into the cornflour paste, then pour into a clean pan. Cook over a medium heat, stirring all the time, until thickened. Remove from the heat, then stir in the crème fraîche until smooth. Pour into a bowl, cover the surface with cling film to stop a skin forming, allow to cool, then chill until completely cold.", "Make the cake: heat oven to 180C/ fan 160C/gas 4. Lightly oil and line the base of a 20cm round cake tin. Put the sugar and eggs into a bowl. Whisk with electric beaters for 5 mins until very thick, paler in colour and the consistency of whipped cream. Sift over the flour and quickly, but lightly, fold it in. Spoon the mixture into the tin and carefully level it, being careful not to squash it. Bake for 25 mins until risen, then remove and cool on a wire rack. Peel off lining paper. Halve the cake so you have a semi-circle. (The other half can be frozen for another time.) Split the semi-circle in half with a knife, then sandwich back together with fruit spread.", "Put the sugar and lime zest for the fruit into a pan with 2 tbsp water. Bring slowly to the boil until the sugar has dissolved, then bubble for 1½-2 mins until syrupy. Tip in the blueberries, then cook very briefly, stirring once or twice only, just until they start to burst and release their juices (but still stay whole) and you get a purple syrup. Set aside to cool.", "The sponge and custard layers can be built up to 2-3 hrs ahead of when you want to serve. Cut the jammy sponge into cubes, then place in the base of a glass dish. Drizzle over the Marsala. Keep about ¼ of the berries back for the top, then spoon the rest over the sponge with a little syrup. Discard the pod from the custard, then pour it over the fruit.", "Just before serving, beat the yogurt, mascarpone and sugar together until smooth and creamy. Pile onto the custard, then drizzle over the reserved fruit and syrup. Use a skewer to swirl some of the juices through the creamy topping. Serve straight away or the syrup discolours the topping. This is best eaten the same day."], "nutrition": {"salt": "292"}, "desc": "Angela Nilsen discovers a lighter way to serve this ever-popular dessert"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Lasagne", "recipe_link": "http://www.bbcgoodfood.com/recipes/7683/the-ultimate-makeover-lasagne", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--337502_10.jpg?itok=jPhwjxek", "author": "Angela Nilsen", "preparation": ["Make the meat sauce: heat oil in a large sauté pan, then tip in onion and fry for 5 mins until golden. Add carrots and garlic, then fry for 2 mins more. Stir in both meats, breaking up the pork with a wooden spoon. Cook over a high heat until the meat is no longer pink and the juices are released. Pour in wine, scrape the bottom of the pan as you stir, then cook for 1-2 mins until the liquid is reduced. Tip in tomato purée, tomatoes and 2 tbsp water, then stir to break up tomatoes. Add ½ tsp nutmeg and some pepper, cover, then simmer for 1 hr, stirring occasionally. Taste and add salt if you like. Mix in torn basil. Sauce can be chilled for up to 1 day.", "While the sauce is simmering, prepare the other layers. Tip the spinach into a large bowl and pour over boiling water. After 30 secs, tip spinach into a colander and put under cold running water briefly to cool. Squeeze to remove excess water. Beat the egg in a bowl, then mix with ricotta, parsley, a pinch of nutmeg and pepper. Soak the lasagne sheets in a single layer in boiling water for 5 mins. (Although the packet says no pre-cook, I find soaking improves the texture.) Drain well. Heat oven to 200C/fan 180C/gas 6.", "Start layering. Spread a few big spoonfuls of sauce to barely cover the base of an ovenproof dish (20 x 29 x 6cm deep). Cover with 2 sheets of lasagne, then spread over half the remaining sauce. Cover with 2 more lasagne sheets, then scatter spinach evenly over. Spread the ricotta mixture on top and cover with 2 more lasagne sheets. Spread with remaining sauce, then scatter over mozzarella and Parmesan to almost cover meat. Top with cherry tomatoes and some pepper, then cover loosely with foil.", "Bake for 35 mins, then remove foil and bake 5-10 mins more. Leave for a few mins, then scatter with basil and serve with salad."], "nutrition": {"salt": "447"}, "desc": "A lighter version of the family classic that retains its full flavour"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: French onion soup", "recipe_link": "http://www.bbcgoodfood.com/recipes/9079/the-ultimate-makeover-french-onion-soup", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--1307451_3.jpg?itok=Ney5sN1M", "author": "Angela Nilsen", "preparation": ["Cut the onions in half lengthways, then slice down into very thin slices. Heat a very large pan, add the oil when hot, stir in the onions, 3 of the thyme sprigs and the bay leaves, then season with a little salt. It will seem like a lot of onions, but they reduce right down. Cook over a high heat for 5 mins, stirring often. The onions shouldn’t brown yet, just start to soften. Lower the heat, then cook slowly for 35 mins, uncovered, stirring often until the onions have reduced right down and are very soft.", "While the onions are cooking, bring the wine to a boil in a small pan, then bubble away for 30 secs. Remove and leave to cool. Tip the flour into a small heavy pan and toast over a medium heat for a few mins, stirring occasionally, until light brown in colour. Set aside.", "When the onions are very soft and reduced, turn up the heat so they caramelise, then cook for another 12-15 mins, stirring along the bottom of the pan occasionally to mix in the brown sticky bits. When the bottom of the pan and all the onions are sticky and a rich brown colour, stir in the flour. With the heat still high, gradually pour in the wine, again stirring in the bits from the bottom. Pour in 1.2 litres of cold water. Stir in the bouillon, then slowly bring everything to the boil. Skim off any froth from the surface. Simmer for 15 mins so all the flavours can mingle.", "While the soup simmers, make the topping. Heat oven to 200C/fan 180C/gas 6. Mix the garlic and the oil together. Brush all over the bread slices, then cut each one into cubes. Scatter over a baking sheet, then bake for 8-10 mins until golden. Set aside. Line a baking sheet with baking parchment or a sheet of non-stick silicone. Remove the leaves from the remaining thyme sprig, then mix with the grated Parmesan. Scatter and spread over the lined baking sheet into a 13 x 8cm rectangle. Bake for about 8 mins until melted and turning golden. Remove, leave to firm up, then snap into jagged pieces.", "To serve, remove and discard the herbs from the soup. Ladle the soup into bowls – scatter over a few croutons, the Gruyère and a grinding of pepper, then perch a Parmesan crisp on top. Serve any remaining croutons separately."], "nutrition": {"salt": "405"}, "desc": "Angela Nilsen gives the French classic a makeover, losing the butter and beef stock to make a lighter soup that's still full of flavour"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Risotto with squash & sage", "recipe_link": "http://www.bbcgoodfood.com/recipes/9800/the-ultimate-makeover-risotto-with-squash-and-sage", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--337513_12.jpg?itok=jbAA5gqz", "author": "Angela Nilsen", "preparation": ["Halve the squash lengthways, then scoop out the seeds. Peel, then cut the flesh into about 2.5cm pieces. Pour the stock into a pan, add the porcini, then bring to a gentle simmer.", "Heat 2 tbsp of the oil in a heavy, wide pan. Add the onion, garlic, sage, thyme and squash, then gently fry for about 10 mins until the squash is almost tender, stirring occasionally, so it doesn’t stick or burn. With the heat on medium, tip the rice into the squash. Keep stirring for 3-4 mins to toast it without colouring. Pour in the wine and stir everything for 1 min.", "Start to add the hot stock (leaving the porcini behind) – this process should take 18-20 mins, so put a timer on if it helps. Stir in 1½ ladles and adjust the heat so it simmers. Keep stirring and scraping down the sides. Once the first lot of stock has been absorbed, add another ladleful, continuing to stir to keep the risotto creamy. Continue adding and stirring in a ladleful of stock as each previous one is absorbed (it’s ready for more when you drag the spoon across the bottom of the pan and it leaves a clear line).", "As the last of the stock goes in (keep a little back) check if the rice is ready – it should be soft with a bit of chew in the middle – and the consistency fluid. Season with pepper.", "Take the pan off the heat. Add a splash of the stock to keep the risotto moist, scatter over the parsley and half the Parmesan, then spoon on the mascarpone. With the lid on, let the risotto sit for 3-4 mins to rest.", "Meanwhile, heat the remaining oil in a small frying pan. Add the sage leaves, then fry for a few secs until starting to colour. Transfer to kitchen paper with a slotted spoon to drain. Spoon the risotto into bowls, then scatter over the rest of the Parmesan and the crisp sage leaves."], "nutrition": {"salt": "517"}, "desc": "Angela's ultimate version of the Italian classic is lower in fat but still wonderfully creamy"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Thai green chicken curry", "recipe_link": "http://www.bbcgoodfood.com/recipes/11252/the-ultimate-makeover-thai-green-chicken-curry", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--337533_12.jpg?itok=fphXLFGz", "author": "Angela Nilsen", "preparation": ["For the curry paste, finely chop the coriander stalks and put them into a mini food blender or small food processor with the shallots, lemongrass, garlic and ginger. Pulse until as smooth as you can get it. Add the chillies, basil, threequarters of the coriander leaves, the ground cumin, coriander, pepper, lime leaves and lime juice, then pulse again. Mix in the oil and set aside. You will only be using half of this paste, the rest can be chilled for a couple of days, or frozen for up to a month.", "For the curry, heat the oil in a non-stick wok or deep sauté pan, stir in half the curry paste, then stir-fry for 1 min. Shake the coconut milk in its can, open, then pour two-thirds into the pan. Let it bubble away for 4-5 mins, stirring now and then, until reduced and thickened slightly.", "Tip in the chicken, then stir-fry for 1-2 mins until no longer pink. Stir in the fish sauce and sugar, then pour in the rest of the coconut milk to give a thinnish, creamy sauce. Lower the heat, add the lime leaves, then simmer for 5 mins to gently finish cooking the chicken. Can be frozen at this point for up to 1 month.", "While the chicken simmers, steam the mangetout and beans for a couple of mins. Serve the curry in bowls with some of the veg piled on top (serve the rest separately) along with the spring onions and the rest of the coriander leaves. Serve with a bowl of Thai fragrant rice and lime wedges for squeezing over."], "nutrition": {"salt": "487"}, "desc": "This normally super-rich curry can be turned into one that’s healthier but still\ncreamy"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Fish pie", "recipe_link": "http://www.bbcgoodfood.com/recipes/420615/the-ultimate-makeover-fish-pie", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--424472_12.jpg?itok=884Lf88o", "author": "Angela Nilsen", "preparation": ["Mix 3 tbsp of the milk into the cornflour and set aside. Pour the rest of the milk into a saucepan. Shell the prawns, reserve the meat, then drop the shells and heads (wash them first if necessary) into the milk along with the thyme sprigs, bay leaves, garlic and a grind of pepper. Bring to a boil, then remove from the heat and leave to infuse for 20 mins.", "Meanwhile, put the potatoes into a large pan of water, bring to the boil and simmer for 20 mins until tender. Drain. Steam the sliced leek for 3 mins, then remove from the heat and set aside.", "Strain the infused milk through a sieve into a large shallow sauté pan. Lay all the fish fillets (not the prawns) in the milk. Bring to a boil, then lower the heat and simmer gently for 3 mins. Remove from the heat and leave, covered, for 5 mins. Use a slotted spoon to transfer all the fish to a dish and leave to cool slightly. Heat oven to 200C/180C fan/gas 6.", "Stir the slackened cornflour, then stir it into the hot milk in the sauté pan. Return the pan to the heat and stir until thickened. Briefly stir in the soft cheese, remove from the heat, then add the parsley and season with black pepper. Stir in any liquid that has drained from the fish. Break the fish into big pieces as you lay them in a 2-litre ovenproof dish so that the different varieties are evenly distributed. Scatter over the prawns and leek, then season with pepper. Pour the sauce over and give a few gentle stirs to evenly distribute the sauce and combine everything without breaking up the fish.", "Using a large fork, crush the potatoes by breaking them up (not mashing them) into chunky pieces. Mix in the oil, chives and a grind of black pepper. Spoon the potato crush over the fish. Sit the dish on a baking sheet and bake for 25-30 mins, or until the sauce is bubbling and the potatoes golden. Alternatively, make the dish completely, refrigerate it for several hrs or overnight, then bake at the same temperature as above for 45 mins."], "nutrition": {"salt": "413"}, "desc": "This traditionally high-fat comfort food favourite has been transformed into a heart-healthy dish"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Fish & chips", "recipe_link": "http://www.bbcgoodfood.com/recipes/5544/the-ultimate-makeover-fish-and-chips", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--484507_11.jpg?itok=f_dPqnqM", "author": "Angela Nilsen", "preparation": ["Scrub the potatoes, cut into 1.5cm thick lengthways slices, then cut each slice into 1.5cm thick chips. Tip the chips into a large saucepan, pour in enough water to just cover, bring to the boil, then lower the heat and gently simmer for 4 mins only. Drain, tip onto a clean tea towel, pat dry, then leave to cool. Can be done 1-2 hrs ahead. Heat oven to 220C/fan 200C/gas 7. Put a large shallow non-stick roasting tray in the oven with 1 tbsp olive oil and heat for 10 mins.", "Transfer the chips to a bowl and toss in the remaining oil using your hands. Tip out in a single layer onto the hot roasting tin. Bake for 10 mins, then turn them over. Bake 5 more mins, then turn again. Bake for a final 5-8 mins until crisp. Drain on paper towels.", "While the chips are in the oven, cook the peas in boiling water for 4 mins. Drain, then tip into the pan and lightly crush with the back of a fork. Mix in the oil, lemon juice and freshly grated pepper. Cover and set aside.", "The fish can also be cooked while the chips are in the oven. Pat the fillets dry with paper towels. Put the 1 tbsp of flour on a plate and use to coat each fillet, patting off the excess. Pour the oil for frying into a heavy, medium non-stick wok or wokshaped pan. Heat to 200C (use a thermometer so you can check the oil stays at that temperature). Mix 50g flour, cornflour, a pinch of salt and some pepper. Lightly whisk the egg white with a balloon whisk until frothy and bubbly, but not too stiff. Pour the water into the flour mix, gently and briefly whisking as you go. The batter shouldn’t be completely smooth. Add the egg white, then lightly whisk in just to mix. Try and keep as many bubbles as you can so the batter stays light. Cooking two pieces of fish at a time, dip them in the batter to coat, let some of it drip off, then lower into the hot oil using a slotted spoon. Fry for 5-6 mins, making sure the oil stays at 200C and turning the fish over halfway through so it is golden all over. Lift out with a slotted spoon, drain on kitchen paper. Check the oil is back up to 200C, then repeat with remaining fish. Reheat the peas and serve with the fish, chips and lemon wedges."], "nutrition": {"salt": "649"}, "desc": "Angela Nilsen takes the British favourite and gives it a lighter, healthier, and modern twist"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Chocolate mousse", "recipe_link": "http://www.bbcgoodfood.com/recipes/473630/the-ultimate-makeover-chocolate-mousse", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--337565_11.jpg?itok=kZ_pyK2U", "author": "Angela Nilsen", "preparation": ["Chop the chocolate very finely and put it into a large bowl that will fit over a pan of simmering water. Mix the cocoa, coffee and vanilla with 2 tbsp cold water, and pour over the chocolate. Place the bowl over the gently simmering water, give it all a stir, then remove from the heat. Leave with the bowl of chocolate still over the water, stirring occasionally to check when melted.", "Stir the melted chocolate, it will be quite thick. Stir in 2 tbsp boiling water and the chocolate will immediately thin down and become silky smooth. Leave to cool slightly.", "Whisk the egg whites to fairly soft peaks, then whisk in the sugar until thick and glossy. Beat the yogurt into the cooled chocolate. Fold about one-third of the egg whites into the chocolate mix using a large metal spoon, then very gently fold in the rest of the whites until they are evenly mixed in – being careful not to over-mix or you will lose the volume of the mousse. Spoon into 4 small cups or (125-150ml) ramekins and chill for a couple of hours, or overnight.", "Place each mousse on a saucer or small plate. Top with a few raspberries, then dust with a little cocoa powder. Will keep for up to 2 days in the fridge."], "nutrition": {"salt": "167"}, "desc": "This sophisticated dessert is great for a dinner party, or for a lighter family pud use ordinary dark chocolate with less cocoa solids"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Chicken korma", "recipe_link": "http://www.bbcgoodfood.com/recipes/13417/the-ultimate-makeover-chicken-korma", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--484495_11.jpg?itok=66txEB0L", "author": "Angela Nilsen", "preparation": ["Heat 1 tbsp of the oil in a deep sauté pan or wok. Tip in the onions, then fry over a medium-high heat for about 12-15 mins, stirring occasionally, until a rich golden colour and the pan is sticky on the bottom. While they cook, chop the garlic and ginger. Make a slit down the length of each cardamom pod just deep enough to reveal the tiny seeds. Remove the onions from the heat. Transfer a third of them to a small blender along with the garlic, ginger and 2 tbsp water. Whizz together to make a paste that is as smooth as you can get it. Set aside.", "Return the onions in the pan to the heat, add the remaining oil, cardamom pods and cinnamon stick, then stir-fry for a couple of mins. Stir in the chicken, ground coriander, 1¼ tsp of the garam masala, mace and black pepper, then stir-fry for another 2 mins. Reserve 3 tbsp of the yogurt, then slowly start to add the rest, 1 tbsp at a time, stirring between each spoonful. When all the yogurt has gone in, stir in the oniony paste and stir-fry for 2-3 mins. Stir in 150ml water, then the milk. Bring to a boil, then simmer, covered, for 20 mins, scattering in the chillies for the final 5 mins, by which time the chicken should be very tender. Remove the cardamom pods and cinnamon. The flavours mellow all the more if refrigerated overnight. When gently reheating, splash in a little water if needed to slacken the korma sauce.", "Finish by stirring in the chopped coriander. Taste and add a little salt if you wish. Swirl in the reserved yogurt. Spoon the korma into bowls, scatter a few almonds over each portion with a sprinkling of the remaining garam masala. Serve the saffron rice on the side."], "nutrition": {"salt": "402"}, "desc": "Try this healthier, more fragrant version of a popular Indian classic"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": null, "recipe_link": "http://www.bbcgoodfood.com/recipes/collection/quick-and-healthy?page=1", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": null, "author": null, "preparation": [], "nutrition": {}, "desc": "Throw together a deliciously tangy and superhealthy couscous salad in just 10 minutes"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Thai-style steamed fish", "recipe_link": "http://www.bbcgoodfood.com/recipes/1031/thaistyle-steamed-fish", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--192665_11.jpg?itok=nkR37Dwm", "author": "Good Food", "preparation": ["Nestle the fish fillets side by side on a large square of foil and scatter the ginger, garlic, chilli and lime zest over them. Drizzle the lime juice on top and then scatter the pieces of pak choi around and on top of the fish. Pour the soy sauce over the pak choi and loosely seal the foil to make a package, making sure you leave space at the top for the steam to circulate as the fish cooks.", "Steam for 15 minutes. (If you haven’t got a steamer, put the parcel on a heatproof plate over a pan of gently simmering water, cover with a lid and steam.)"], "nutrition": {"fat": "199"}, "desc": "Serve with Thai jasmine rice for a flavour-packed low-fat meal"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Spaghetti carbonara", "recipe_link": "http://www.bbcgoodfood.com/recipes/1572659/the-ultimate-makeover-spaghetti-carbonara", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--736498_11.jpg?itok=SDJ7-mN4", "author": "Angela Nilsen", "preparation": ["Bring a large saucepan of water to a boil with a pinch of salt. Then get everything ready. Grate the cheese and beat the eggs in a bowl with a little pepper. Cook the peas in boiling water for 2-3 mins, drain and set aside.", "Cook the spaghetti to al dente following pack instructions. While the spaghetti is cooking, heat the oil in a large, deep frying or sauté pan. Fry the bacon for several mins until it starts to go crisp. Stir in the garlic and cook briefly until pale brown. Tip in the peas and if the spaghetti isn’t quite ready, keep warm over a very low heat.", "When the pasta is done, take the pan with the bacon in off the heat. Lift the spaghetti out of its pan with a pair of tongs and drop it into the frying pan with the garlic, bacon and peas. Mix most of the cheese into the eggs, keeping back a handful of cheese for sprinkling over each serving. Quickly pour in the eggs and cheese, lifting and stirring with the tongs so everything mixes well and the spaghetti gets coated. Ladle in some more of the pasta water, enough to coat the spaghetti and create a bit of sauce in the pan.", "Spoon or twirl the pasta into shallow serving bowls using a long pronged fork. Serve immediately with a sprinkling of the reserved cheese, some snipped chives and a grating of black pepper."], "nutrition": {}, "desc": "Italian comfort food without the calories, this recipe is rich and creamy, yet just one third of the fat"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Burgers", "recipe_link": "http://www.bbcgoodfood.com/recipes/1377634/the-ultimate-makeover-burgers", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--659514_11.jpg?itok=3Q15pXJP", "author": "Angela Nilsen", "preparation": ["Tip the mince into a bowl with the spring onions, grated carrot, garlic, mustard, tarragon and egg. Mix well using a fork. Season with pepper and a pinch of salt, then divide the mixture into 4. Flatten each piece with your hands into a 10cm round (A), about 2cm thick – a similar width to the buns. Chill for about 30 mins. Or can be made a day ahead: stack the burgers between pieces of greaseproof paper to stop them sticking, wrap in cling film then chill until ready to cook.", "Meanwhile, heat oven to 200C/fan 180C/ gas 6. Lay the peppers, cut sides down, on a non-stick baking sheet. Roast for 35 mins until the skins are charred, laying the tomatoes next to them, cut-side up, for the final 3 mins just to soften slightly. Remove and immediately transfer the peppers to a small bowl and cover with cling film. Leave for 5-10 mins until cool enough to handle. Peel off the pepper skins (B), chop the peppers and tip them back into the bowl to join any juices there. Chop the tomatoes and stir into the peppers with the lime juice, chives, onion and chillies. Taste and add a grind of pepper if needed. Set aside. Can be made 1-2 days ahead and chilled.", "Heat a griddle pan, or cook the burgers on the barbecue. Lay the cut sides of the buns on the griddle and cook until marked with the griddle bars. Brush each burger on one side with some of the rapeseed oil. Place on the hot griddle, oiled side down. Cook – don’t move them or they may stick – for 5 mins for medium, brush the unoiled side with the rest of the oil (C), then turn and cook for another 5 mins. (For well done, add an extra 1-2 mins to each side.)", "Remove and let the burgers rest for 2-3 mins. Drizzle a little of the pepper juices over the bottom of each bun to moisten, lay on some watercress sprigs, top with a burger, then a spoonful of the salsa (D), spooning over some more of the juices. Sandwich together with the tops of the buns."], "nutrition": {"salt": "405"}, "desc": "Turn a barbecue favourite into a superhealthy treat without compromising on taste"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Superhealthy salmon burgers", "recipe_link": "http://www.bbcgoodfood.com/recipes/7712/superhealthy-salmon-burgers", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--195496_11.jpg?itok=_FOm-kuD", "author": "Good Food", "preparation": ["Tip the salmon into a ", " with the paste, ginger, soy and ", " coriander. Pulse until roughly minced. Tip out the mix and shape into 4 burgers. Heat the oil in a ", ", then fry the burgers for 4-5 mins on each side, turning until crisp and cooked through.", "Meanwhile, use a ", " to peel strips of carrot and cucumber into a bowl. Toss with the vinegar and sugar until the sugar has dissolved, then toss through the coriander leaves. Divide the salad between 4 plates. Serve with the burgers and rice."], "nutrition": {"salt": "292"}, "desc": "Fantastic combination of flavours that was loved by the whole family - my children even gave me a high five. I'll be making this one again that's for sure."},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Tiramisu", "recipe_link": "http://www.bbcgoodfood.com/recipes/1514651/the-ultimate-makeover-tiramisu", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--736494_11.jpg?itok=kCL-Vxy5", "author": "Angela Nilsen", "preparation": ["First make the coffee soaking liquid for the sponge fingers. Stir the coffee and sugar together, then pour into a shallow heatproof dish. Stir in the Marsala and leave to cool.", "Meanwhile, prepare the filling. Put the sugar and cornflour into a medium saucepan, preferably non-stick. Stir in 1 tbsp of the measured milk to make a thin, smooth paste. Separate the egg, putting the white into a medium bowl and setting it aside, and dropping the yolk into the saucepan. Beat the yolk into the cornflour paste, then stir in the rest of the milk. Scrape the seeds from the vanilla pod into the pan, then drop in the pod. Cook over a medium-low heat for about 8-10 mins without letting the mixture boil, stirring all the time, until the mixture thickly coats the back of a wooden spoon. Remove from the heat, then stir in the crème fraîche and the 1 tbsp of Marsala. Transfer the mixture to a bowl, cover the surface with cling film and leave until cold.", "To assemble, line a 23 x 13 x 6cm deep loaf tin with cling film (see step 1), leaving an overlap at the top. Beat together the mascarpone and soft cheese, then stir into the rest of the cold filling. Whisk the egg white to stiff peaks and gently fold into the filling using a large metal spoon.", "Dip one of the sponge fingers in the coffee mixture, rolling it around briefly, for a few secs only, to coat and soak in, then lift it out before it has a chance to get too soggy (see step 2). If left in the coffee, it will disintegrate. Lay it lengthways in the bottom of the tin. Do the same with 5 more of the sponge fingers, trimming to fit if necessary, so that they cover the bottom of the tin. Spoon over half of the filling, spreading it to cover the biscuits (see step 3), then repeat the biscuit dipping with 6 more of them. Spoon and spread over the rest of the filling, then dip and lay the rest of the sponge fingers over the top (see step 4). Bring the cling film overhang over to cover. Chill overnight.", "To serve, turn out onto a serving plate and carefully peel off the cling film. Dust the top with cocoa and scatter with raspberries, if using. Slice and serve the same day."], "nutrition": {"salt": "220"}, "desc": "Angela Nilsen lightens a classic high-fat Italian dessert without compromising on the rich indulgence factor"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Lemon tart", "recipe_link": "http://www.bbcgoodfood.com/recipes/644635/the-ultimate-makeover-lemon-tart", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--488711_11.jpg?itok=RlRMvnbj", "author": "Angela Nilsen", "preparation": ["Rub the butter into the flour until the mix looks like fine breadcrumbs. Stir in the icing sugar, then make a well and use a round-bladed knife to stir in the oil, egg yolk and 1½-2 tbsp cold water until dough comes together. Without overhandling, gather into a ball. On a lightly floured surface, roll out so it fits a 23 x 2cm loose-bottom flan tin. Ease the pastry into the tin, then trim the edges by rolling the rolling pin over the top. Press the pastry into the flutes so it sits very slightly proud of the edge (this extra height helps in case of any shrinkage). Lightly prick the pastry base with a fork, then chill for about 10 mins. Heat the oven to 190C/170C fan/gas 5.", "Meanwhile, make the filling. Beat the eggs and egg whites together with a wooden spoon until well mixed. Sift the icing sugar into a bowl, then gradually beat in the eggs. If the mix is at all lumpy, simply beat with a wire whisk. Stir in the lemon zest and the juice. Leave to stand so the lemon flavour can develop.", "Sit the chilled pastry case on a baking sheet. Line with baking parchment and baking beans and bake blind for 20 mins until well set. Carefully lift out the beans and paper, then bake the pastry case for another 3-5 mins until the base is cooked and pale golden.", "Strain the lemon mixture through a sieve. Beat the crème fraîche in a medium bowl until smooth, then slowly stir in the lemon mix until well blended. Transfer to a jug, then carefully pour two thirds into the warm pastry case. Place in the oven with the oven shelf half out, pour in the rest of the filling, then carefully slide the shelf back in. Reduce the heat to 150C/130C fan/gas 2. Bake for 25-30 mins until barely set with a slight wobble in the middle. Cool for about 1 hr, then serve with a light dusting of icing sugar. Best eaten the same day."], "nutrition": {"salt": "186"}, "desc": "Enjoy an incredible half-fat version of this classic dessert, which tastes every bit as good as the original"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "The ultimate makeover: Full English breakfast", "recipe_link": "http://www.bbcgoodfood.com/recipes/5820/the-ultimate-makeover-full-english-breakfast", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--592533_12.jpg?itok=yoVezNCb", "author": "Angela Nilsen", "preparation": ["Lay the bacon, mushrooms and tomatoes on a foil-lined tray. Brush the tops of the mushrooms with 3 tsp of the oil and both sides of the bread with the remaining oil. Set aside. Heat the grill to very hot. Lay the sausages on a small foil-lined tray (best not to prick good-quality sausages or they may lose moisture). Grill for about 10 mins until cooked, turning occasionally.", "Meanwhile, three-quarters fill a small pan, and a wide, deep sauté pan with water. Bring both to the boil. Lower an egg into the small pan and remove after 30 secs. Crack the egg into a cup. Add vinegar to the larger pan then, using a wire whisk, swirl the water around to create a whirlpool. Remove the whisk and slowly tip the egg into the centre of the whirlpool (see top picture). When the water comes back to the boil, remove the pan from the heat, cover and leave for 3 mins, then remove the egg. Place in a bowl of warm water while you cook the other egg – or cook both eggs an hour ahead, leave in a bowl of iced water, then reheat for 1½ mins in simmering water before serving.", "Meanwhile heat a griddle pan to very hot. Place the tomatoes, bacon and mushrooms under the grill for 3-4 mins without turning. At the same time, lay the bread on the griddle pan, cook until crisp, about 1 min each side. Drain everything on kitchen paper.", "Remove the eggs with a slotted spoon and drain briefly on a cloth. Arrange everything on a plate and serve with the juice and fruit."], "nutrition": {}, "desc": "Angela Nilsen makes a healthier version of an iconic English meal - without losing the nostalgia"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Stir-fried beef with hoisin sauce", "recipe_link": "http://www.bbcgoodfood.com/recipes/3246/stirfried-beef-with-hoisin-sauce", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--4850_12.jpg?itok=2MNKlVBz", "author": "Good Food", "preparation": ["Mix together the soy sauce, sherry, sesame oil, garlic and ginger in a shallow dish. Add the steak and leave to marinate for about 20 minutes (or longer, if you have time).", "Heat a large heavy-based frying pan or wok, add the sesame seeds and toast over a high heat, stirring, for a few minutes until golden. Tip on to a plate.", "When ready to cook, heat the sunflower oil in a large frying pan or wok until hot. Add the steak with the marinade and stir fry for 3-4 minutes over a high heat until lightly browned. Remove, using a slotted spoon, on to a plate, leaving the juices in the pan.", "Toss the carrots in the pan and stir fry for a few minutes, then add the mangetout and cook for a further 2 minutes.", "Return the steak to the pan, add the mushrooms and toss everything together. Add the hoisin sauce and stir fry for a final minute. Sprinkle with the toasted sesame seeds and serve immediately."], "nutrition": {}, "desc": "Quick, easy to make and healthy"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Harissa prawn skewers with carroty couscous", "recipe_link": "http://www.bbcgoodfood.com/recipes/3161696/harissa-prawn-skewers-with-carroty-couscous", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--1309535_3.jpg?itok=1huE_en3", "author": "Good Food", "preparation": ["Heat the olive oil in a pan with the cumin seeds and toast for a few mins until aromatic. Tip in the carrots, season, then cook for 3 mins until tender. Transfer to a bowl, then pour over the couscous and 400ml hot water. Cover with cling film and leave for 10 mins, or until all the water has been absorbed and the couscous is tender.", "Meanwhile, heat the grill to high. Put the prawns, cherry tomatoes and onion wedges in another bowl, season, then stir in the harissa. Thread everything onto skewers (if using wooden skewers, soak them in water first to prevent burning), then lay on a baking tray. Grill for 2-3 mins each side, or until the prawns are cooked though.", "Mix the tahini, yogurt, garlic, lemon juice and seasoning to make a sauce. Fork the mint though the couscous, transfer to a platter and place the skewers on top. Drizzle over any cooking juices, and serve with a dollop of sauce and lemon wedges."], "nutrition": {"salt": "6g", "kcal": "344"}, "desc": "These vibrant, low-calorie prawn kebabs are served with delicious minty houmous, tahini and garlic yogurt"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Vitality chicken salad with avocado dressing", "recipe_link": "http://www.bbcgoodfood.com/recipes/3159689/vitality-chicken-salad-with-avocado-dressing", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--1309491_2.jpg?itok=sov5r_kv", "author": "Good Food", "preparation": ["Blanch the soya beans for 3 mins. Rinse in cold water and drain thoroughly. Put the chicken, beans and cucumber in a bowl.", "Blitz the avocado, Tabasco, lemon juice and oil in a food processor or with a hand blender. Season, pour into the bowl and mix well to coat.", "Spoon the mixture into the lettuce leaves (or serve it alongside them) and sprinkle with the seeds. Chill until lunch, then serve with a lemon wedge."], "nutrition": {"salt": "28g", "kcal": "433"}, "desc": "A super-green, healthy mix of soya beans, cucumber, avocado and Little Gem lettuce - topped with lean shredded chicken breast"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Chicken, broccoli & beetroot salad with avocado pesto", "recipe_link": "http://www.bbcgoodfood.com/recipes/chicken-broccoli-beetroot-salad-avocado-pesto", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/chicken-broccoli-beetroot-salad-with-avocado-pesto.jpg?itok=efax5Tbk", "author": "Emily Kydd", "preparation": ["Bring a large pan of water to the boil, add the broccoli and cook for 2 mins. Drain, then refresh under cold water. Heat a griddle pan, toss the broccoli in 1⁄2 tsp of the rapeseed oil and griddle for 2-3 mins, turning, until a little charred. Set aside to cool. Brush the chicken with the remaining oil and season. Griddle for 3-4 mins each side or until cooked through. Leave to cool, then slice or shred into chunky pieces.", "Next, make the pesto. Pick the leaves from the basil and set aside a handful to top the salad. Put the rest in the small bowl of a food processor. Scoop the flesh from the avocado and add to the food processor with the garlic, walnuts, oil, 1 tbsp lemon juice, 2-3 tbsp cold water and some seasoning. Blitz until smooth, then transfer to a small serving dish. Pour the remaining lemon juice over the sliced onions and leave for a few mins.", "Pile the watercress onto a large platter. Toss through the broccoli and onion, along with the lemon juice they were soaked in. Top with the beetroot, but don’t mix it in, and the chicken. Scatter over the reserved basil leaves, the lemon zest and nigella seeds, then serve with the avocado pesto."], "nutrition": {"kcal": "320"}, "desc": "This superfood supper is packed with ingredients to give your body a boost, such as red onion, nigella seeds, walnuts, rapeseed oil and lemon"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Spaghetti with cherry tomato & black olive sauce", "recipe_link": "http://www.bbcgoodfood.com/recipes/3147688/spaghetti-with-cherry-tomato-and-black-olive-sauce", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--1308500_2.jpg?itok=WHXKODOO", "author": "Jennifer Joyce", "preparation": ["Cook the pasta following pack instructions in salted water until al dente. Meanwhile, put the tomatoes in a bowl with the oil, basil, olives, capers, lemon zest and juice, and a pinch of salt and mix together.", "Drain the pasta, then return to the pan. Add the tomato mixture and mix again to combine. Serve with the cheese sprinkled on top."], "nutrition": {"salt": "613"}, "desc": "A healthy, vegetarian pasta dish with tomatoes, capers, olives and lots of basil"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Stir-fried chicken with broccoli & brown rice", "recipe_link": "http://www.bbcgoodfood.com/recipes/stir-fried-chicken-broccoli-brown-rice", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/stirfrychicken_5795.jpg?itok=ozFU2oTp", "author": "Sara Buenfeld", "preparation": ["Put the kettle on to boil and tip the broccoli into a medium pan ready to go on the heat. Pour the water over the broccoli then boil for 4 mins.", "Heat the olive oil in a non-stick wok and stir-fry the ginger, garlic and onion for 2 mins, add the mild chilli powder and stir briefly. Add the chicken and stir-fry for 2 mins more. Drain the broccoli and reserve the water. Tip the broccoli into the wok with the soy, honey, red pepper and 4 tbsp broccoli water then cook until heated through. Meanwhile, heat the rice following the pack instructions and serve with the stir-fry."], "nutrition": {"kcal": "448", "fat": "9g"}, "desc": "Combine lean chicken with super-healthy broccoli, ginger and garlic for a quick and cheap, weeknight dinner"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Spiced black bean & chicken soup with kale", "recipe_link": "http://www.bbcgoodfood.com/recipes/spiced-black-bean-chicken-soup-kale", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/spiced-black-bean-chicken-soup-with-kale.jpg?itok=xdf3KV3s", "author": "Jane Hornby", "preparation": ["Heat the oil in a large saucepan, add the garlic, coriander stalks and lime zest, then fry for 2 mins until fragrant. Stir in the cumin and chilli flakes, fry for 1 min more, then tip in the tomatoes, beans and stock. Bring to the boil, then crush the beans against the bottom of the pan a few times using a potato masher. This will thicken the soup a little.", "Stir the kale into the soup, simmer for 5 mins or until tender, then tear in the chicken and let it heat through. Season to taste with salt, pepper and juice from half the lime, then serve in shallow bowls, scattered with the feta and a few coriander leaves. Serve the remaining lime in wedges for the table, with the toasted tortillas on the side. The longer you leave the chicken in the pan, the thicker the soup will become, so add a splash more stock if you can’t serve the soup straight away."], "nutrition": {"fat": "293"}, "desc": "Use up leftover roast or ready-cooked chicken in this healthy and warming South-American style soup, spiced up with cumin and chilli"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Spaghetti with smoky tomato & seafood sauce", "recipe_link": "http://www.bbcgoodfood.com/recipes/spaghetti-smoky-tomato-seafood-sauce", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/spaghetti-smoky-tomato-seafood-sauce.jpg?itok=C7x-UL_I", "author": "Cassie Best", "preparation": ["Boil the kettle and heat the oil in a large, deep frying pan. Add the garlic, chilli and fennel seeds, and sizzle for a few mins. Pour the boiling water into a large pan and cook the pasta following pack instructions.", "Add the paprika, tomatoes, sugar and seasoning to the pan and simmer for 8-10 mins while the pasta cooks.", "Drain the pasta 1 min before the end of the cooking time, reserving a cup of the water. Add the pasta to the sauce with the seafood. Simmer for 1-2 mins, adding a splash of the reserved pasta water if it looks too thick. Toss the pasta through the sauce as it cooks. Add the herbs and black pepper, then serve."], "nutrition": {}, "desc": "Chilli, fennel seeds and smoked paprika add warmth and flavour to a rich tomato sauce, served with seafood in this quick pasta dish"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Thai prawn & ginger noodles", "recipe_link": "http://www.bbcgoodfood.com/recipes/thai-prawn-ginger-noodles", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/thai-prawn-ginger-noodles.jpg?itok=LWCZ2blm", "author": "Sara Buenfeld", "preparation": ["Put the noodles in a bowl and pour over boiling water to cover them. Set aside to soak for 10 mins. Stir together the orange juice and zest, curry paste, fish sauce, sugar and 3 tbsp water to make a sauce.", "Heat the oil in a large wok and add half the ginger and the garlic. Cook, stirring, for 1 min. Add the pepper and stir-fry for 3 mins more. Toss in the sugar snaps, cook briefly, then pour in the curry sauce. Add the beansprouts and prawns, and continue cooking until the prawns just turn pink. Drain the noodles, then toss these into the pan with the herbs and remaining ginger. Mix until the noodles are well coated in the sauce, then serve."], "nutrition": {"kcal": "426", "fat": "9g"}, "desc": "This seafood stir-fry, with fiery ginger and crunchy veg, is as healthy as it is delicious - a low-fat and low-calorie weeknight dinner"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Asian pulled chicken salad", "recipe_link": "http://www.bbcgoodfood.com/recipes/asian-pulled-chicken-salad", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/asian-pulled-chicken-salad.jpg?itok=71TJPg9O", "author": "Emily Kydd", "preparation": ["Combine the dressing ingredients in a small bowl and set aside.", "Remove all the meat from the chicken, shred into large chunks and pop in a large bowl. Add the cabbage, carrots, spring onions, chillies and half the coriander. Toss together with the dressing and pile onto a serving plate, then scatter over the remaining coriander and peanuts."], "nutrition": {"kcal": "352"}, "desc": "Pull apart a ready-roasted chicken to whip up this healthy, vibrant, low-calorie dish in just 20 minutes"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Seafood tagine", "recipe_link": "http://www.bbcgoodfood.com/recipes/seafood-tagine", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/seafood-tagine.jpg?itok=svYS08PF", "author": "Katy Greenwood", "preparation": ["Heat the oil in a large pan and cook the onion and red pepper for about 5 mins until softened. Stir in the garlic, harissa and chopped tomatoes, and cook for about 10 mins until thickened. Add the frozen seafood and cook through, about 10 mins more.", "Put the couscous in a serving bowl, pour over boiling water to cover, then cover with cling film. Leave to soak while the tagine cooks, then stir in most of the coriander, the almonds, lemon zest and juice, and seasoning. Serve the tagine with the couscous and cut the remaining lemon half into wedges to squeeze over. Sprinkle over the remaining coriander and serve."], "nutrition": {"fat": "534"}, "desc": "Use a frozen mix of fish and shellfish to make this Moroccan stew, served over a zesty almond couscous"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Chicken satay salad", "recipe_link": "http://www.bbcgoodfood.com/recipes/chicken-satay-salad", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/chicken-satay-salad.jpg?itok=AxyLnTOs", "author": "Sara Buenfeld", "preparation": ["Pour the tamari into a large dish and stir in the curry powder, cumin, garlic and honey. Mix well. Slice the chicken breasts in half horizontally to make 4 fillets in total, then add to the marinade and mix well to coat. Set aside in the fridge for at least 1 hr, or overnight, to allow the flavours to penetrate the chicken.", "Meanwhile, mix the peanut butter with the chilli sauce, lime juice, and 1 tbsp water to make a spoonable sauce. When ready to cook the chicken, wipe a large non-stick frying pan with a little oil. Add the chicken and cook, covered with a lid, for 5-6 mins on a medium heat, turning the fillets over for the last min, until cooked but still moist. Set aside, covered, to rest for a few mins.", "While the chicken rests, toss the lettuce wedges with the cucumber, shallot, coriander and pomegranate, and pile onto plates. Spoon over a little sauce. Slice the chicken, pile on top of the salad and spoon over the remaining sauce. Eat while the chicken is still warm."], "nutrition": {"kcal": "353", "fat": "10g"}, "desc": "Marinate chicken breasts, then drizzle with a punchy peanut satay sauce for a no-fuss, midweek meal that's high in protein and big on flavour"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Lemon cod with basil bean mash", "recipe_link": "http://www.bbcgoodfood.com/recipes/7189/lemon-cod-with-basil-bean-mash", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--338860_11.jpg?itok=jRl-cUSI", "author": "Good Food", "preparation": ["Heat oven to 200C/fan 180C/gas 6. Put the tomatoes onto a baking tray, rub with a little oil and some seasoning, then roast for 5 mins until the skins are starting to split. Add the fish to the tray, top with most of the lemon zest and some more seasoning, then drizzle with a little more oil. Roast for 8-10 mins until the fish flakes easily.", "Meanwhile, cook the beans in a pan of boiling water for 3 mins until just tender. Drain, then tip into a food processor with the rest of the oil, garlic, basil stalks, lemon juice and stock, then pulse to a thick, slightly rough purée. Season to taste.", "Divide the tomatoes and mash between two plates, top with the cod, then scatter with basil leaves and the remaining lemon zest to serve."], "nutrition": {"salt": "372"}, "desc": "A heart-healthy supper that makes the perfect midweek meal for two"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Veggie wholewheat pot noodle", "recipe_link": "http://www.bbcgoodfood.com/recipes/veggie-wholewheat-pot-noodle", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/veggie-wholewheat-pot-noodle.jpg?itok=mQShXHig", "author": "Chelsie Collins", "preparation": ["Fill a large saucepan with water and bring to the boil. Add the noodles and cook for 3-5 mins or until tender. Drain and leave to cool.", "Place a large non-stick pan (or wok) over a medium-high heat and add the groundnut oil. When hot, add the red pepper and cook for 2-3 mins until slightly softened. Add the courgette and edamame, and cook for a further 1-2 mins. Remove from the heat, transfer to a bowl and allow to cool.", "Whisk together the dressing ingredients in a small bowl, or 2 jars if taking to work, then season.", "Divide the noodles between 2 jars or plastic containers and top with the cooled vegetables, beansprouts, carrot, spinach, crispy onions and coriander. Add the dressing just before eating."], "nutrition": {}, "desc": "This clever packed lunch is super healthy, with crisp vegetables, wholewheat noodles and a spicy, zingy dressing"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Pomegranate chicken with almond couscous", "recipe_link": "http://www.bbcgoodfood.com/recipes/pomegranate-chicken-almond-couscous", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/pomegranate-chicken.jpg?itok=_hrmBzMW", "author": "Cassie Best", "preparation": ["Boil the kettle and heat the oil in a large frying pan. Put the couscous in a bowl with some seasoning and crumble in half the stock cube. Add the onion to the pan and fry for a few mins to soften. Pour boiling water over the couscous to just cover, then cover the bowl with a tea towel and set aside.", "Push the onion to one side of the pan, add the chicken fillets and brown on all sides. Stir in the tagine paste or harissa and the pomegranate juice, then crumble in the rest of the stock cube and season well. Simmer, uncovered, for 10 mins until the sauce has thickened and the chicken is cooked through. Stir through the pomegranate seeds, saving a few to scatter over before serving.", "After 5 mins, fluff up the couscous with a fork and stir through the almonds and mint. Serve the chicken on the couscous with the sauce spooned over."], "nutrition": {}, "desc": "Jazz up chicken breasts in this fruity, sweetly spiced sauce with pomegranate seeds, toasted almonds and tagine paste"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Masala frittata with avocado salsa", "recipe_link": "http://www.bbcgoodfood.com/recipes/masala-frittata-avocado-salsa", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2016/01/masala-frittata-with-avocado-salsa.jpg?itok=TndLTd_b", "author": "Jemma Morphet", "preparation": ["Heat the oil in a medium non-stick, ovenproof frying pan. Tip in the sliced onions and cook over a medium heat for about 10 mins until soft and golden. Add the Madras paste and fry for 1 min more, then tip in half the tomatoes and half the chilli. Cook until the mixture is thick and the tomatoes have all burst.", "Heat the grill to high. Add half the coriander to the eggs and season, then pour over the spicy onion mixture. Stir gently once or twice, then cook over a low heat for 8-10 mins until almost set. Transfer to the grill for 3-5 mins until set.", "To make the salsa, mix the avocado, remaining chilli and tomatoes, chopped onion, remaining coriander and the lemon juice together, then season and serve with the frittata."], "nutrition": {"kcal": "347"}, "desc": "Really yummy!! added in sweet potato aswell and made it even better! Would definitely recommend to friends and family. :)"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Spicy cauliflower pilau", "recipe_link": "http://www.bbcgoodfood.com/recipes/spicy-cauliflower-pilau", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/spicy-cauliflower-pilau.jpg?itok=4I7r01qR", "author": "Sara Buenfeld", "preparation": ["Put the cauliflower florets in a food processor and pulse to make grains the size of rice. Tip into a microwaveable bowl and stir in the cloves, cinnamon stick, turmeric and curry leaves.", "Mix well, cover with cling film, pierce and microwave on High for 3 mins. Fluff up with a fork and serve."], "nutrition": {"fat": "53"}, "desc": "This healthy, Indian-inspired side dish is made from cauliflower florets instead of rice - a quick and gluten-free addition to curry night"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Omelette pancakes with tomato & pepper sauce", "recipe_link": "http://www.bbcgoodfood.com/recipes/omelette-pancakes-tomato-pepper-sauce", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/omelette-pancakes-with-tomato-pepper-sauce.jpg?itok=2ekDv2a-", "author": "Sara Buenfeld", "preparation": ["First make the sauce. Heat the oil in a large frying pan, and fry the pepper and garlic for 5 mins to soften them. Spoon in the cider vinegar and allow to sizzle away. Tip in the tomatoes, then measure in a third of a can of water. Cover and leave to simmer for 10-15 mins until the peppers are tender and the sauce is thick.", "Meanwhile, make the pancakes. Beat 1 egg with 1 tsp water and seasoning, then heat a small non-stick frying pan with a tiny amount of oil. Add the egg mixture and cook for 1-2 mins until set into a thin pancake. Lift onto a plate, cover with foil and repeat with the other eggs. Roll up onto warm plates, spoon over the sauce and scatter with the basil. Serve with bread or a salad on the side."], "nutrition": {"kcal": "271"}, "desc": "Healthy, low-calorie and gluten-free - these herby egg 'pancakes' will become your go-to favourite for a quick midweek meal"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Chicken fattoush", "recipe_link": "http://www.bbcgoodfood.com/recipes/chicken-fattoush", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/chicken-fattoush.jpg?itok=6S86L4o_", "author": "Miriam Nice", "preparation": ["Pour the lemon juice into a large bowl and whisk while you slowly add the oil. When all the oil has been added and the mixture starts to thicken, season.", "Add the lettuce, tomatoes, parsley, cucumber, chicken pieces and spring onions, and stir well to coat the salad in the dressing.", "Put the pitta breads in the toaster until crisp and golden, then chop into chunks. Scatter the toasted pitta pieces over the salad and sprinkle over the sumac. Serve straight away."], "nutrition": {"kcal": "313"}, "desc": "This healthy Middle Eastern salad topped with sumac-sprinkled pitta bread is a quick and easy lunch or supper"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Thai green pork lettuce cups", "recipe_link": "http://www.bbcgoodfood.com/recipes/thai-green-pork-lettuce-cups", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2016/01/thai-green-pork-lettuce-cups.jpg?itok=ZXSAAPq4", "author": "Katy Greenwood", "preparation": ["Heat the oil in a frying pan and cook the pork for 8-10 mins or until cooked through. Stir in the green curry paste and 2 tbsp water, then cook for 1-2 mins. ", "Remove from the heat and stir in the red onion, lime juice, fish sauce and herbs. Spoon the pork into the lettuce leaves and serve with rice, if you like. "], "nutrition": {}, "desc": "This is a really nice dish. Beautiful flavour combination. Instead of rice I chose to serve it with mung bean vermicelli with peanut butter and soy sauce which adds and twist of nuttyness."},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Banana & pecan loaf", "recipe_link": "http://www.bbcgoodfood.com/recipes/693646/banana-and-pecan-loaf", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--363953_11.jpg?itok=TSltITxo", "author": "Sarah Cook", "preparation": ["Heat oven to 160C/140C fan/gas 3. Grease and line a 2lb/900g loaf tin with a long strip of baking parchment. To make the loaf cake batter, beat the butter and sugar with an electric whisk until light and fluffy. Add the bananas in a few chunks and beat in with the eggs, flour, almonds, baking powder and milk until smooth – the whisk will mash the bananas. Stir in the pecans, then scrape into the tin. Bake for 45-50 mins until golden, risen and a skewer poked in comes out clean. Cool in the tin, then lift out.", "Beat the butter, icing sugar and vanilla. Spread on top of the cooled cake and scatter with more chopped pecans"], "nutrition": {"salt": "608"}, "desc": "This tea-time favourite is moist, sweet, nutty and comforting - it's bound to be a hit with friends and family"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Sticky toffee banoffee cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/1998/sticky-toffee-banoffee-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--364199_12.jpg?itok=SQT-JZQw", "author": "Good Food", "preparation": ["Heat oven to 190C/fan 170C/gas 5. Butter two 20cm sandwich tins and line with non-stick baking paper. In a large bowl, beat all the cake ingredients together including the vanilla extract and 2 mashed, ripe bananas, until you have a smooth, soft batter.", "Divide the mixture between the tins, smooth the surface with a spatula or the back of a spoon, then bake for about 20 mins until golden and the cake springs back when pressed. Turn onto a cooling rack and leave to cool completely.", "For the filling, whip the double cream and fold through the Banoffee toffee. To serve, spread half of the cream over one of the cakes, then top with another sliced banana.", "Sandwich together, then cover with more cream then decorate the cake with an elegant drizzle of Banoffee toffee. Keep in an airtight container and eat within 2 days."], "nutrition": {"salt": "494"}, "desc": "Sticky toffee banoffee, a variation on the classic Victoria sponge theme, perfect for birthdays and special occasion cakes"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Choc-cherry muffins", "recipe_link": "http://www.bbcgoodfood.com/recipes/1737/choccherry-muffins", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2010/08/recipe-image-legacy-id-363944_11.jpg?itok=nR_UFDZO", "author": "Jenny White", "preparation": ["Heat oven to 200C/fan 180C/gas 6 and line a 12-hole muffin tin with some paper cases. Sift the flour, and bicarbonate of soda into a large bowl, then stir in the cherries, chocolate and sugar. Add the beaten eggs, yogurt and then the butter and stir to combine. It doesn’t matter if the mixture looks a bit lumpy, it’s more important not to overmix or the muffins will turn out tough.", "Fill the paper cases and bake for 20-25 mins until risen and golden brown. Transfer to a rack to cool. They are especially delicious eaten slightly warm."], "nutrition": {"salt": "386"}, "desc": "one of the best muffins i have ever baked! soft, tasty, not too sweet and scrummy. a must do again!\nalso made some slight subs like 50 gr milk choc + 50 gr white and used cranberries instead of cherries and only used 1/2 tsp of bic. soda and 90 gr greek yog + 60 gr milk = 14 pretty big muffins with only 250 calories each! AMAZING TOTALLY IN LOVE!"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Cappuccino cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/2006/cappuccino-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--363865_11.jpg?itok=aQmZP2Tm", "author": "Jane Hornby", "preparation": ["Heat oven to 180C/fan 160C/gas 4. Butter 2 x 20cm sandwich tins and line the bottoms with greaseproof paper. Beat butter and sugar together with electric beaters until pale and creamy. Add the fl our and eggs in one go and keep beating until evenly mixed. Fold in the walnuts (if using) and half of the coffee. Spoon the mix into the prepared tins and bake for 25-30 mins or until golden and well risen.", "Leave the cakes in their tins for 5 mins before turning onto a wire rack. Sweeten the remaining coffee with the extra sugar and sprinkle 4 tbsp over the sponges. Leave to cool completely.", "While the cakes cool, make the frosting. Tip the mascarpone into a large bowl and beat in the sugar and remaining coffee until smooth and creamy. Use about half of the frosting to sandwich the sponges together then, using a palette or cutlery knife, spread the rest of the frosting over the top of the cake. Decorate with a dusting of cocoa powder or drinking chocolate. If you’re making this cake to eat at home, it will keep covered in the fridge for 2-3 days."], "nutrition": {"salt": "559"}, "desc": "If you've offered to bake a treat for a stall or your local coffee morning then this cake stall classic is just the thing"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Granny's Victoria sponge", "recipe_link": "http://www.bbcgoodfood.com/recipes/532634/grannys-victoria-sponge", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--363933_12.jpg?itok=cm06vhxi", "author": "James Martin", "preparation": ["Heat oven to 190C/170C fan/gas 5. Grease and flour 2 x 20cm sandwich tins. Place the butter, sugar and vanilla extract into a bowl and beat well to a creamy consistency. Slowly beat in the eggs, one by one, then fold in the flour and mix well.", "Divide the mix between the cake tins, place into the oven and bake for about 20 mins until risen and golden brown. The cakes should spring back when gently pushed in the middle. When ready, remove from the oven and allow to cool for 5 mins in the tin, before turning out onto a wire rack and cooling completely.", "Spread the jam onto one cake and top with the cream. Sandwich the cakes together and dust with icing sugar."], "nutrition": {"salt": "599"}, "desc": "The classic Victoria sandwich is always a teatime winner, every bite brings a taste of nostalgia"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Pineapple upside-down cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/5562/pineapple-upsidedown-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--363769_12.jpg?itok=QqHLzoC5", "author": "Sara Buenfeld", "preparation": ["Heat oven to 180C/160C fan/gas 4. For the topping, beat the butter and sugar together until creamy. Spread over the base and a quarter of the way up the sides of a 20-21cm round cake tin. Arrange pineapple rings on top, then place cherries in the centres of the rings.", "Place the cake ingredients in a bowl along with 2 tbsp of the pineapple syrup and, using an electric whisk, beat to a soft consistency. Spoon into the tin on top of the pineapple and smooth it out so it’s level. Bake for 35 mins. Leave to stand for 5 mins, then turn out onto a plate. Serve warm with a scoop of ice cream."], "nutrition": {"salt": "407"}, "desc": "Retro rocks. This classic pineapple upside-down cake makes a fun centre piece for afternoon tea and brings back many childhood memories."},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Lemon drizzle cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/4942/lemon-drizzle-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--1238452_7.jpg?itok=Hnxk9fQn", "author": "Tana Ramsay", "preparation": ["Heat oven to 180C/fan 160C/gas 4. ", " 225g softened unsalted butter and 225g caster sugar until pale and creamy, then add 4 eggs, one at a time, slowly mixing through. Sift in 225g flour, then add the finely grated zest of 1 lemon and ", " until well combined. Line a loaf tin (8 x 21cm) with greaseproof paper, then spoon in the mixture and level the top with a spoon.", "Bake for 45-50 mins until a thin skewer inserted into the centre of the cake comes out clean. While the cake is cooling in its tin, mix together the juice of 1 1/2 lemons and 85g caster sugar to make the drizzle. Prick the warm cake all over with a skewer or fork, then pour over the drizzle – the juice will sink in and the sugar will form a lovely, crisp topping. Leave in the tin until completely cool, then remove and serve. Will keep in an airtight container for 3-4 days, or freeze for up to 1 month."], "nutrition": {"salt": "399"}, "desc": "I've made this loads of times, it is fab, easy and always goes down well!! The timings for cooking are fine, I always give 50 mins. And I throw everything into the food processor to mix, never been an issue. In fact, just going to make another one now"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Lemon curd & blueberry loaf cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/358609/lemon-curd-and-blueberry-loaf-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--363874_11.jpg?itok=-wktqBqO", "author": "Sarah Cook", "preparation": ["Heat oven to 160C/140C fan/gas 3. Grease a 2lb loaf tin and line with a long strip of baking parchment. Put 100g yogurt, 2 tbsp lemon curd, the softened butter, eggs, lemon zest, flour and caster sugar into a large mixing bowl. Quickly mix with an electric whisk until the batter just comes together. Scrape half into the prepared tin. Weigh 85g blueberries from the punnet and sprinkle half into the tin, scrape the rest of the batter on top, then scatter the other half of the 85g berries on top. Bake for 1 hr 10 mins-1 hr 15 mins until golden, and a skewer poked into the centre comes out clean.", "Cool in the tin, then carefully lift onto a serving plate to ice. Sift the icing sugar into a bowl and stir in enough lemon juice to make a thick, smooth icing. Spread over the top of the cake, then decorate with lemon zest and edible flowers, if you like. Serve in slices with extra lemon curd, Greek yogurt and blueberries."], "nutrition": {"salt": "663"}, "desc": "Kids can help make this simple springtime treat - delicious with extra lemon curd and yogurt as a pud, or serve with a cuppa"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Chocolate marble cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/5557/chocolate-marble-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--363765_11.jpg?itok=Y0IAzwXZ", "author": "Emma Lewis", "preparation": ["Heat oven to 180C/gas 160C/gas 4. Grease a 20cm cake tin and line the bottom with a circle of greaseproof paper. If you want to make life easy, simply put all the ingredients (except the cocoa powder) into a ", " and whizz for 1-2 mins until smooth. If you prefer to mix by hand, ", " the butter and sugar together, then add the eggs, one at a time, mixing well after each addition. ", "through the flour, milk and vanilla extract until the mixture is smooth.", "Divide the mixture between 2 ", ". Stir the cocoa powder into the mixture in one of the bowls. Take 2 spoons and use them to dollop the chocolate and vanilla cake mixes into the tin alternately. When all the mixture has been used up (and if young kids are doing this, you’ll need to ensure the base of the tin is fairly evenly covered), tap the bottom on your work surface to ensure that there aren’t any air bubbles. Take a skewer and swirl it around the mixture in the tin a few times to create a marbled effect.", "Bake the cake for 45-55 mins until a skewer inserted into the centre comes out clean. Turn out onto a ", " and leave to cool. Will keep for 3 days in an ", " or freeze for up to 3 months."], "nutrition": {"salt": "468"}, "desc": "Woo ow! This recipe is great. No regrets..\nHave baked it for my granny. So yummmyyyyyy!!!. Thanks a lot. Give it a try you will not regret!"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Raspberry Bakewell cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/11695/raspberry-bakewell-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--559459_11.jpg?itok=Dg7CFR8B", "author": "Barney Desmazery", "preparation": ["Heat oven to 180C/160C fan/gas 4 and base-line and grease a deep 20cm loose-bottomed cake tin. Blitz the ground almonds, butter, sugar, flour, eggs and vanilla extract in a ", " until well combined.", "Spread half the mix over the cake tin and smooth over the top. Scatter the raspberries over, then dollop the remaining cake mixture on top and roughly spread – you might find this easier to do with your fingers. Scatter with flaked almonds and bake for 50 mins until golden. ", ", remove from the tin and dust with icing sugar to serve."], "nutrition": {"salt": "411"}, "desc": "Love this recipe fairly easy as said don't be deterred by batter thickness.\nWill make again have tried Raspberry and Blackberries"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Fruity traybake", "recipe_link": "http://www.bbcgoodfood.com/recipes/lindas-fruity-traybake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/traybake.jpg?itok=HDHKAajx", "author": "Good Food", "preparation": ["Heat oven to 180C/160C fan/gas 4. Grease and line a 22cm square tin with baking parchment. Whisk the oil and sugar in a large mixing bowl until light and fluffy. Beat in the eggs, one at a time, followed by the banana. Stir through the apples, carrots, mango and lemon zest. Combine the flour, bicarb and mixed spice in another bowl, then fold into the fruit mixture.", "Pour the mixture into the tin and bake for 40 mins, until a skewer inserted comes out clean. Cool for 10 mins before turning out onto a wire rack.", "To make the icing, beat together the icing sugar, passion fruit or lemon curd and the cream cheese. Spread over the top of the cake and cut into square pieces to serve."], "nutrition": {}, "desc": "A moist sponge made from banana, apple, carrots and mango, topped with a fruity cream cheese frosting"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Microwave chocolate cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/1977663/microwave-chocolate-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--911517_11.jpg?itok=5EXfUts3", "author": "Good Food", "preparation": ["Grease a 22cm silicone microwaveable cake pan with a little oil and place a circle of baking parchment in the bottom.", "Mix sugar, flour, cocoa and baking powder in a bowl. In a jug, whisk the oil, eggs, vanilla and 100ml hot water until combined.", "Add liquid ingredients to the dry ingredients and mix thoroughly until you have a lump-free batter. Pour mixture into the cake pan and gently tap to pop any air bubbles. Cover with cling film.", "Microwave on Full power (800 watts) for 7 mins. Remove and check if the cake is cooked by poking a skewer into the middle: if it comes out clean it is ready. Allow cake to stand for 5 mins, then remove cling film and turn out onto a cooling rack.", "For the ganache, melt the chocolate on Half power (600 watts) for approximately 2 mins, stirring every 30 secs until melted. Add the cream and mix thoroughly until smooth and glossy.", "Once the cake is cool, spread over the ganache and scatter with the sprinkles. The cake will keep for up to 3 days in an airtight container."], "nutrition": {"salt": "364"}, "desc": "Edwina Hanslo's delicious and super quick chocolate cake with a creamy ganache is the perfect choice for busy mums!"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Blood orange & poppy drizzle muffins", "recipe_link": "http://www.bbcgoodfood.com/recipes/blood-orange-poppy-drizzle-muffins", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/blood-orange-poppy-drizzle-muffins.jpg?itok=rlTVWFTl", "author": "Sarah Cook", "preparation": ["Heat oven to 200C/180C fan/gas 6 and lightly grease a 12-hole muffin tin. Mix together the flour, caster sugar, baking powder and poppy seeds in a large mixing bowl. In another bowl, whisk together the oil, milk, egg, and zest and juice from 1 of the oranges.", "Working very quickly, pour the wet ingredients into the dry and barely mix together with a fork – the mixture should be lumpy, so don’t overwork it. Spoon the mixture into the tins and bake for 10-12 mins until risen and browned.", "While the muffins are baking, mix the remaining zest with the granulated sugar in a small bowl. Have the remaining blood orange juice ready too.", "Leave the muffins to cool for 2 mins, then transfer to a wire rack. Again working quickly, pour the juices into the sugar mix and spoon some over each muffin, repeating until it is all used up. Leave to set for 5 mins before eating."], "nutrition": {}, "desc": "These citrussy muffins are lovely and light, and make a delicious pudding served with ice cream or thick Greek yogurt"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Hot cross bread & lemon pudding", "recipe_link": "http://www.bbcgoodfood.com/recipes/2068642/hot-cross-bread-and-lemon-pudding", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--923531_11.jpg?itok=OLvRd5uc", "author": "Sarah Cook", "preparation": ["Butter a 1-litre baking dish that will quite snugly fit the buns. Cut each bun into 3 slices, and sandwich back together with a generous spreading of curd. Arrange buns in the dish.", "Whisk egg, cream, milk and remaining curd, then sieve into a jug with the vanilla and 3 tbsp of the sugar. Pour over the buns and stand at room temperature for 30 mins for the custard to soak in.", "Heat oven to 160C/140C fan/ gas 3. Scatter the remaining sugar and lemon zest over the pudding. Bake for 30-40 mins until the top is golden and the custard gently set. Stand for 5 mins, then serve with cream or vanilla ice cream, if you like."], "nutrition": {"salt": "676"}, "desc": "Use up your leftover fruit buns in this sumptuous spin on traditional bread and butter pudding - a great spring bake"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "New potato, spring onion & Montgomery cheddar quiche", "recipe_link": "http://www.bbcgoodfood.com/recipes/1267654/new-potato-spring-onion-and-montgomery-cheddar-qui", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--624457_11.jpg?itok=75MfkwAv", "author": "Tom Kerridge", "preparation": ["Sift the flour and a pinch of salt into a large bowl. Add the butter and rub in until it resembles breadcrumbs. Stir in the icing sugar, egg yolk and 3 tbsp cold water, then quickly bring together to form a firm dough. Wrap well in cling film and allow to rest for 20 mins in the fridge.", "Heat oven to 200C/180C fan/gas 6. Roll out the pastry on a lightly floured surface and line a deep 23cm tart tin. Cover with baking parchment and fill with baking beans. Cook for 20 mins, then remove the paper and beans and cook for 5-10 mins more until the tart case is pale and sandy in texture (see p14 for tips on making and baking pastry).", "Remove and turn the oven down to 160C/140C fan/gas 2. Spread the base of the tart with the potatoes, onions and cheddar. Whisk together the eggs, milk and cream, then season. Pour into the tart case and cook for 40-45 mins or until just set. Remove, cool on a wire rack then serve."], "nutrition": {"salt": "583"}, "desc": "Chef Tom Kerridge shares a larger version of a dainty tartlet he serves on his lunch menu at the Hand & Flowers in Marlow"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Spring green fattoush", "recipe_link": "http://www.bbcgoodfood.com/recipes/468651/spring-green-fattoush", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--256496_10.jpg?itok=pC-Jeb1Z", "author": "Good Food", "preparation": ["First get all the ingredients ready. Bring a pan of water to the boil, add the beans and boil for 2-3 mins until just tender. Drain, rinse with cold water to cool, then drain again. Pod the beans from their skins into a large mixing bowl, discard the skins. Halve cucumber lengthways, scrap out the seeds using a teaspoon, then slice into half-moons and throw in with the beans. Split the pittas so you have 6 thin circles of bread, then toast.", "Whisk together lemon zest, juice, olive oil and sugar with plenty of seasoning. Pour over the beans and cucumber, add all the herbs and toss together. Tear the toasted pitta into pieces and add this to the salad with the crumbled feta. Toss together very gently – hands are best – then pile onto a platter to serve."], "nutrition": {"salt": "264"}, "desc": "Savour all the flavours of spring in every bite with this elegant, seasonal salad"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Courgette & orange cake with cream cheese frosting", "recipe_link": "http://www.bbcgoodfood.com/recipes/courgette-orange-cake-cream-cheese-frosting", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/courgette-cake.jpg?itok=cRqdc5th", "author": "Sara Buenfeld", "preparation": ["Heat oven to 180C/160C fan/gas 4. Lightly oil and line a 1kg loaf tin with a strip of baking parchment. Finely grate the courgettes, then squeeze out as much liquid as you can with your hands (too much will make the cake soggy).", "Stir the courgettes with the sugar, sunflower oil, eggs, orange zest, vanilla and sultanas, then fold in the flour and baking powder until they disappear, but don’t overmix.", "Scrape the mixture into the tin and bake for 50 mins until a skewer inserted into the cake comes out clean. Remove from the tin and cool on a wire rack.", "Meanwhile, beat the cream cheese with the icing sugar (don’t overbeat as this can make the mixture too soft), then chill. Spread over the cooled cake, scatter with the zest and chill until ready to serve. Will keep for a week in the fridge."], "nutrition": {}, "desc": "Forget the carrot cake, this light, moist courgette cake is packed with flavour and it goes perfectly with a cup of tea"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Spring vegetable tagliatelle with lemon & chive sauce", "recipe_link": "http://www.bbcgoodfood.com/recipes/460647/spring-vegetable-tagliatelle-with-lemon-and-chive-", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--259451_10.jpg?itok=U4eLkLJC", "author": "Mary Cadogan", "preparation": ["Halve the green beans and cut the asparagus into 3 pieces on the diagonal. Cook the tagliatelle, adding the vegetables for the final 5 mins of the cooking time.", "Meanwhile, grate the zest from half the lemon and squeeze the juice from the whole lemon. Put juice in a small pan with the mustard, olive oil and a little black pepper. Warm through until smooth.", "Drain the pasta and veg, adding 4 tbsp of the water to the lemon sauce. Return the pasta to the pan, reheat the sauce, adding most of the chives, then add to the pasta, tossing everything together well. Divide between 4 shallow bowls and top each with black pepper, Parmesan and the remaining chives."], "nutrition": {"salt": "469"}, "desc": "Put some spring into your pasta, with this fresh yet simple supper idea. It's on the table in under half an hour and is low-fat too"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Vegan banana & peanut butter cupcakes", "recipe_link": "http://www.bbcgoodfood.com/recipes/vegan-banana-peanut-butter-cupcakes", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/cupcakes_0.jpg?itok=hVlldW-4", "author": "Good Food", "preparation": ["Heat oven to 170C/150C fan/gas 31⁄2. Line muffin tins with 16 cases. In a bowl, combine the flour, sugar, 1⁄2 tsp salt and bicarbonate of soda. In a second bowl or a jug, mix the mayonnaise, mashed bananas and vanilla extract. Pour the wet ingredients into the dry and mix with a spoon until just combined (don’t overmix or your cupcakes will be heavy). Spoon the mixture into the cases and bake for 20 mins.", "When the cupcakes come out of the oven, sprinkle the chocolate chips over – they will melt and then harden again, so don’t touch them.", "For the icing, combine the vegan margarine and icing sugar in an electric mixer, then add the vegan milk and continue to mix on a slow speed until completely combined. Turn the mixer up and combine for a further 3 mins. Finally, stir in the peanut butter. Pipe or simply spread the icing on top of the cakes. Store in an airtight container and eat within 2 days."], "nutrition": {}, "desc": "Employ some clever tricks to achieve a dairy-free bake - egg-free mayonnaise, almond milk and margarine fit the bill"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Lemon poppyseed cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/lemon-poppyseed-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/lemon-and-poppyseed.jpg?itok=7r7jFE7_", "author": "Mary Cadogan", "preparation": ["Heat oven to 180C/160C fan/gas 4. Grease and line the base of a 20cm square deep cake tin (or if using a decorative tin like ours, grease well).", "In a bowl, beat the butter and sugar until fluffy. Add the rest of the ingredients and beat until combined. Spoon into the tin and smooth over the top. Bake for 40-45 mins. Cool in the tin for 10 mins, then turn out, peel off the parchment and leave to cool on a wire rack.", "Sift the icing sugar into a bowl. Beat in the lemon juice to make a runny icing. Pour over the cake and leave to set."], "nutrition": {}, "desc": "Lemon and poppyseed cake is a baking classic, packed with zesty flavours and drenched in icing for the ultimate treat alongside a cuppa"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Asparagus, broad bean & smoked salmon pasta", "recipe_link": "http://www.bbcgoodfood.com/recipes/1910/asparagus-broad-bean-and-smoked-salmon-pasta-", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--1774_11.jpg?itok=H17J1vhc", "author": "Maxine Clark", "preparation": ["Melt the butter in a pan, then fry the spring onions for 1 minute, until softened. Add the wine and boil hard to reduce to about 2 tbsp. Stir in the crème fraîche, season well and add the nutmeg. Bring to the boil and simmer for 2-3 minutes until slightly thickened. Stir in the dill, if using, and squeeze in a little lemon juice. Set aside.", "Blanch the shelled broad beans in boiling salted water for 2-3 minutes. Drain into a sieve and hold under running cold water to cool. Drain again and peel off the outer hard skin – make a nick in the tops and pop the beans out.", "Trim the asparagus – if it’s young, it won’t need much cut off the stems. Cut into halves or thirds. Cook the pasta in salted boiling water as per pack instructions, adding the asparagus 3 minutes before the end of cooking time. Cook until “al dente”.", "Drain well, reserving a little pasta water. Toss the hot pasta and asparagus with the drained broad beans, smoked salmon and sauce, loosening with a spoonful or two of pasta water, if necessary. The heat of the pasta should reheat the sauce and slightly cook the smoked salmon, but stir over a gentle heat to warm through if necessary. Serve immediately."], "nutrition": {"salt": "626"}, "desc": "A seasonal supper or lunch"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Easy one-pot chicken casserole", "recipe_link": "http://www.bbcgoodfood.com/recipes/1993649/easy-onepot-chicken-casserole", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--908543_10.jpg?itok=7h3zI6zr", "author": "Sarah Cook", "preparation": ["Put the kettle on. Fry the thighs in the oil in a casserole or wide pan with a lid to quickly brown. Stir in the whites of the spring onion with the flour and stock cubes until the flour disappears, then gradually stir in 750ml hot water from the kettle. Throw in the carrots and potatoes, bring to a simmer. Cover and cook for 20 mins.", "Take off the lid and simmer for 15 mins more, then throw in the peas for another 5 mins. Season, stir in the mustard, green spring onion bits, herbs and some seasoning."], "nutrition": {}, "desc": "A light and quick spring chicken and vegetable stew that can be whipped up in less than an hour"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Roast salmon with peas, potatoes & bacon", "recipe_link": "http://www.bbcgoodfood.com/recipes/2063656/roast-salmon-with-peas-potatoes-and-bacon", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--991488_10.jpg?itok=AJi2GN9-", "author": "Good Food", "preparation": ["Heat oven to 220C/200C fan/gas 7. Tip the potatoes into a large shallow roasting tin and toss with 1 tsp olive oil and some seasoning. Roast for 20 mins until just starting to colour, then scatter over the lardons and return to the oven for 10 mins to crisp up.", "Remove the tin from the oven, push the potatoes and bacon to the sides and lay the salmon in the middle. Brush with remaining oil, season, then return to the oven and cook for 20 mins more until the salmon is just cooked through. Meanwhile, cook the peas in boiling water for 2 mins and drain.", "When the fish is cooked, lift it to a serving dish. Stir the peas and spring onions through the potatoes, drizzle with a splash of vinegar, stir through the mint and season to taste. Spoon around the salmon and serve."], "nutrition": {"salt": "548"}, "desc": "A brilliant all-in-one dish that's perfect for a Friday night fish supper or summer roast"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Spring fish pie", "recipe_link": "http://www.bbcgoodfood.com/recipes/2235/spring-fish-pie", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--2502_12.jpg?itok=_IsmYX98", "author": "Good Food", "preparation": ["Heat oven to 220C/fan 200C /gas 7. Tip the spinach into a colander sitting in the sink and tip the potatoes into a saucepan. Bring a kettle full of water to the boil and pour enough over the potatoes to cover and slowly pour the rest over the spinach to wilt it. Bring the potatoes to the boil and cook for 8-10 mins until tender, then drain and roughly mash.", "Leave the spinach to cool, then squeeze out excess water with your hands. Scatter the spinach over the bottom of 2 individual or 1 small ovenproof dish leaving two gaps for the eggs. Crack the eggs into the gaps, then season with salt and pepper. Distribute the fish over the spinach and eggs. Spread over the crème fraîche and drizzle with the lemon juice. Loosely spoon over the potatoes, drizzle over the olive oil, then bake for 20-25 mins until the top is crispy and golden and the sauce is bubbling at the sides. Leave to stand for a few mins, then serve straight from the dish."], "nutrition": {"salt": "529"}, "desc": "A special after-work supper treat - easily doubled if you've got friends over"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Asparagus, sundried tomato & olive loaf", "recipe_link": "http://www.bbcgoodfood.com/recipes/10595/asparagus-sundried-tomato-and-olive-loaf", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--25131_12.jpg?itok=013iotra", "author": "Mary Cadogan", "preparation": ["Heat oven to 190C/fan 170C/gas 5. Oil and line the base of a loaf tin (approx 22 x 10 x 5cm) with baking paper. Cook the asparagus in boiling, salted water for 2 mins, drain, then cool quickly under cold running water. Pat dry.", "Mix the flour and thyme with seasoning in a large bowl. Make a well in the centre, then add the eggs, milk and oil, stirring all the time to draw the flour into the centre. Beat for 1 min to make a smooth batter.", "Reserve 5 asparagus tips and a few olives. Add the remaining asparagus, tomatoes, olives and two-thirds of the cheese to the batter. Pour into the tin, then put the reserved asparagus and olives on top. Sprinkle with the remaining cheese. Bake for 35-40 mins until the cake feels firm to the touch and is golden and crusty on top. Cool in the tin for 5 mins, then turn out and cool on a wire rack."], "nutrition": {"salt": "317"}, "desc": "Spring flavour in every bite of this savoury bake"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Greek roast lamb", "recipe_link": "http://www.bbcgoodfood.com/recipes/5892/greek-roast-lamb", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--1035742_11.jpg?itok=3GgK-2kL", "author": "Barney Desmazery", "preparation": ["Heat oven to 240C/fan 220C/gas 9. Pound the garlic, half the oregano, lemon zest and a pinch of salt in a pestle and mortar, then add the lemon juice and a drizzle of olive oil. Stab the lamb all over with a sharp knife, then push as much of the herb paste as you can into the holes.", "Tip the potatoes into a large roasting tin, then toss in the remaining olive oil and any remaining herb paste. Nestle the lamb amongst the potatoes, roast for 20 mins, then reduce the temperature to 180C/fan 160C/gas 4. Roast for 1 hr 15 mins for medium-rare, adding another 15 mins if you prefer your lamb medium. Baste the lamb once or twice with the juices and toss the potatoes. When the lamb is done to your liking, remove from the tin and let it rest. Throw the rest of the oregano in with the potatoes, scoop from the tin and keep warm.", "Place the roasting tin over a medium flame, add the canned tomatoes and olives to the pan juices, then simmer for a few mins. Serve the lamb with the potatoes and sauce and a simple salad."], "nutrition": {"salt": "685"}, "desc": "If Spring is in the air you don't want to be slaving over a hot oven, so make the most of seasonal lamb the easy way with this lazy roast"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Sausage & spring mash pie", "recipe_link": "http://www.bbcgoodfood.com/recipes/5888/sausage-and-spring-mash-pie", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--9517_11.jpg?itok=PxtYuofa", "author": "Jane Hornby", "preparation": ["Boil the potatoes in salted water for 15 mins, adding the cabbage for the final few mins of cooking. Drain, then allow to steam- dry for a few mins. Add the milk and butter to the pan, warm through, then mash into the potatoes and cabbage with plenty of seasoning. Stir in the mustard, if using.", "While the potatoes are cooking, heat a large, shallow flameproof dish or a large non-stick frying pan. Brown the sausages, shallots and carrots for about 5 mins until nicely golden and the shallots are starting to soften. The sausages should be almost cooked through; lift them out, then set aside. Tip off any excess fat released by the sausages.", "Heat oven to 200C/fan 180C/gas 6. Turn up the heat under the pan, tip in the thyme and mushrooms, then fry until golden, about 3 mins. Splash in the wine, then let it bubble and reduce by half. Add the stock and caramelised onions, then simmer until it has reduced a little to make a shiny gravy, and the carrots are cooked through. Season, then add the sausages to the gravy.", "Spoon the mixture into a baking dish or keep in the pan if it’s ovenproof. Top with the mashed potato, spooning it over in even dollops to prevent the gravy oozing up the sides. Can be made up to 1 day ahead and chilled. Bake, covered with foil, for 30 mins (or 45 mins from chilled), removing the foil for the final 10 mins to brown the mash. Sprinkle with a little thyme to serve."], "nutrition": {}, "desc": "Comfort food doesn't get much better than this"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Spring veggie casserole with little herb dumplings", "recipe_link": "http://www.bbcgoodfood.com/recipes/3291/spring-veggie-casserole-with-little-herb-dumplings", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--4943_11.jpg?itok=I_gS9fEP", "author": "Good Food", "preparation": ["To make the dumplings, rub the flour and butter together so it looks like breadcrumbs. Stir in the cheese, parsley and salt and pepper to season and set aside.", "Heat the oil in a large pan or flameproof casserole (about 3.5 litres) over a high-ish heat, then throw in the halved shallots. Fry for 2-3 minutes till beginning to soften and turn brown and gold in places. Now still working on quite a high heat, add the potatoes and watch for the same effect, about 5-7 minutes, stirring with a wooden spoon and generally moving the pan about a bit. Add the garlic, carrots and fennel, allowing a couple of minutes between each so they get a chance to release their flavours. Pour in the stock along with most of the wine, then stir in the sugar and soy sauce and return to the boil. Simmer covered for 10 minutes. If preparing ahead make up to the end of step 2, cool and chill for up to five hours. About 20 minutes before you are ready to serve, bring back to the boil, and continue with step 3.", "Stir about 2 tbsp of water into the dumpling mixture to form a soft dough. Break off small pieces to make 20-25 dumplings, then shape into rounds about the size of a cherry tomato. Add the green beans and simmer for 5 minutes, then add the mushrooms and courgettes. Stir the cornflour into the remaining wine until it has dissolved, then stir into the casserole until it thickens. Bring to the boil, stir well then gently place the dumplings on top. Cover the pan with a lid and simmer gently for about 15 minutes till the dumplings have risen, and the stew is rich and thick and the vegetables deliciously tender. Check the seasoning.", "Mix the chilli and herbs together in a small bowl and scatter on top of the casserole."], "nutrition": {"salt": "335"}, "desc": "A vegetarian supper full of fresh flavours, perfect for sharing with friends"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Spring salmon with minty veg", "recipe_link": "http://www.bbcgoodfood.com/recipes/3549/spring-salmon-with-minty-veg", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--229541_12.jpg?itok=wQJVWbe6", "author": "Good Food", "preparation": ["Boil the potatoes in a large pan for 4 mins. Tip in the peas and beans, bring back up to a boil, then carry on cooking for another 3 mins until the potatoes and beans are tender. Whizz the olive oil, lemon zest and juice and mint in a blender to make a dressing(or finely chop the mint and whisk into the oil and lemon).", "Put the salmon in a microwave-proof dish, season, then pour the dressing over. Cover with cling film, pierce, then microwave on High for 4-5 mins until cooked through. Drain the veg, then mix with the hot dressing and cooking juices from the fish. Serve the fish on top of the vegetables."], "nutrition": {"salt": "555"}, "desc": "An easy-to-prepare healthy meal which counts for two of your five-a-day"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Rhubarb spice cake", "recipe_link": "http://www.bbcgoodfood.com/recipes/5881/rhubarb-spice-cake", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--560896_11.jpg?itok=UHE4yjCI", "author": "Mary Cadogan", "preparation": ["Heat oven to 180C/fan 160C/gas 4 and put the kettle on. Butter and line a deep 20cm square cake tin. Sift the flour and spices into a bowl. Beat together the butter and sugar until light and fluffy in the food processor, then beat in the golden syrup. Dissolve the bicarbonate of soda in 200ml boiling water, then gradually pour through the spout of the processor. Pulse in the flour, then add the eggs, mixing briefly. Remove the bowl from the processor, then gently stir in the rhubarb.", "Pour the mixture into the tin and bake for 50-60 mins, until the cake feels firm to the touch and springs back when pressed. Cool in the tin for 5 mins, then turn out and cool on a wire rack. Dust with icing sugar."], "nutrition": {"salt": "290"}, "desc": "Five stars ."},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Hot-smoked salmon salad with a chilli lemon dressing", "recipe_link": "http://www.bbcgoodfood.com/recipes/5890/hotsmoked-salmon-salad-with-a-chilli-lemon-dressin", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--9520_11.jpg?itok=Y9wRsShV", "author": "Good Food", "preparation": ["Boil potatoes in salted water for 10 mins until tender, adding the asparagus tips for the final 2 mins of cooking. Drain and allow to cool. Whisk together the salad dressing ingredients. then season to taste.", "In a large bowl, toss together the potatoes, asparagus, salad leaves, herbs and radishes. Add two-thirds of the dressing, thoroughly mix through the salad, then spread the salad over a large platter. Break the hot-smoked salmon into large chunks, then scatter over the top along with the spring onions. Finish by pouring remaining dressing over the top."], "nutrition": {}, "desc": "This delicious salad is thrown together in minutes to make a fresh, seasonal dish that’s stylish enough for entertaining"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Pea, mint & spring onion soup with Parmesan biscuits", "recipe_link": "http://www.bbcgoodfood.com/recipes/408630/pea-mint-and-spring-onion-soup-with-parmesan-biscu", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--424550_12.jpg?itok=_kzGMcYZ", "author": "Good Food", "preparation": ["Heat the olive oil and butter in a heavy based pan. When foaming, add the spring onions and potato. Gently fry without colouring for about 5 mins. Stir in the stock, bring to the boil and simmer for 10 mins or until the potato is tender.", "Stir in the peas, bring to the boil again, then cook for about 3 mins until they are just done. Remove the pan from the heat, add the mint leaves and whizz in a blender or food processor until smooth.", "To make the Parmesan biscuits, heat the grill to high. Line a baking sheet with baking parchment and divide the grated Parmesan into 6 long strips. Grill for 1 min or until the cheese has melted and is lightly golden. While still warm and a bit flexible, release the biscuits from the baking parchment with a palette or cutlery knife, then cool until firm.", "To serve, heat the soup and divide between 6 bowls. Scatter with mint and sliced spring onions, if you like, and serve with the Parmesan biscuits on the side."], "nutrition": {"salt": "213"}, "desc": "The Parmesan 'tuiles' make this soup stylish enough for entertaining - but they take just a few minutes to make"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "20-minute seafood pasta", "recipe_link": "http://www.bbcgoodfood.com/recipes/1940/20minute-seafood-pasta-", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--22610_11.jpg?itok=gXuxI8bR", "author": "Good Food", "preparation": ["Heat the oil in a wok or large frying pan, then cook the onion and garlic over a medium heat for 5 mins until soft. Add the paprika, tomatoes and stock, then bring to the boil.", "Turn down the heat to a simmer, stir in the pasta and cook for 7 mins, stirring occasionally to stop the pasta from sticking. Stir in the seafood, cook for 3 mins more until it’s all heated through and the pasta is cooked, then season to taste. Sprinkle with parsley and serve with lemon wedges."], "nutrition": {"salt": "370"}, "desc": "Make a low-fat, satisfying dish in minutes - ideal for Friday nights"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Flambéed chicken with asparagus", "recipe_link": "http://www.bbcgoodfood.com/recipes/10599/flambed-chicken-with-asparagus", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--52847_12.jpg?itok=42e3D3QT", "author": "Mary Cadogan", "preparation": ["Dust the chicken with the flour. Heat the oil and butter in a large, wide pan with a lid, add the chicken, then fry on all sides until nicely browned. Add the shallots, then fry for about 2 mins until they start to soften, but not colour. Pour in the brandy, carefully ignite, then stand well back until the flames have died down. Stir in the stock and bring to the boil. Reduce heat, cover, then cook for 15 mins until the chicken is just tender.", "Add the asparagus to the sauce. Cover, then cook for 5 mins more until tender. Stir in the crème fraîche and tarragon and warm through. Season to taste."], "nutrition": {"salt": "395"}, "desc": "An elegant spring dinner party dish that looks and tastes very special. Perfect with new potatoes"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Parmesan spring chicken", "recipe_link": "http://www.bbcgoodfood.com/recipes/5987/parmesan-spring-chicken", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--327529_11.jpg?itok=NLxh_GCp", "author": "Good Food", "preparation": ["Heat grill to medium and line the grill pan with foil. Beat the egg white on a plate with a little salt and pepper. Tip the Parmesan onto another plate. Dip the chicken first in egg white, then the cheese. Grill the coated chicken for 10-12 mins, turning once until browned and crisp.", "Meanwhile, boil the potatoes for 10 mins, adding the peas for the final 3 mins, then drain. Toss the vegetables with the spinach leaves, vinegar, oil and seasoning to taste. Divide between four warm plates, then serve with the chicken."], "nutrition": {"salt": "339"}, "desc": "Full of spring flavours, the Parmesan coating gives a satisfying crunch and the meat stays tender"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Spring chicken in a pot", "recipe_link": "http://www.bbcgoodfood.com/recipes/10052/spring-chicken-in-a-pot", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--513635_11.jpg?itok=CpUnFxL4", "author": "Mary Cadogan", "preparation": ["Heat the oil in a large, heavy pan. Add the onion, gently fry for 5 mins until softened, add the chicken, then fry until lightly coloured. Add the potatoes, stock and plenty of freshly ground black pepper, then bring to the boil. Cover, then simmer for 30 mins until the potatoes are tender and the chicken is cooked. Can be frozen at this point.", "Add the broccoli, spring greens, petit pois and spring onions, stir well, then return to the boil. Cover, then cook for 5 mins more, stir in the pesto and heat through."], "nutrition": {"salt": "339"}, "desc": "Casseroles aren't just for winter - this light, vibrant one-pot is packed with spring veg and herby pesto"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "20-minute beef in red wine", "recipe_link": "http://www.bbcgoodfood.com/recipes/2908/20minute-beef-in-red-wine", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--338735_12.jpg?itok=i2svdR_L", "author": "Good Food", "preparation": ["Heat the oil in a pan. Fry steak for 2 mins on each side until brown. Remove steak to a plate, then throw the onion, garlic and oregano into the pan. Fry for 5 mins until starting to turn golden.", "Tip the wine and tomatoes into the pan, then simmer for 10 mins until thickened and rich. Slice the steak into chunks, return to the pan with any juices, then simmer for a few mins to reheat. Serve with pasta, chips or some fried potatoes."], "nutrition": {"salt": "619"}, "desc": "A rich and warming one-pot casserole for one"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "One-pan salmon with roast asparagus", "recipe_link": "http://www.bbcgoodfood.com/recipes/5925/onepan-salmon-with-roast-asparagus", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--52738_10.jpg?itok=SHmSjftT", "author": "Barney Desmazery", "preparation": ["Heat oven to 220C/fan 200C/gas 7. Tip the potatoes and 1 tbsp of olive oil into an ", ", then roast the potatoes for 20 mins until starting to brown. Toss the asparagus in with the potatoes, then return to the oven for 15 mins.", "Throw in the cherry tomatoes and vinegar and nestle the salmon amongst the vegetables. Drizzle with the remaining oil and return to the oven for a final 10-15 mins until the salmon is cooked. Scatter over the basil leaves and serve everything scooped straight from the dish."], "nutrition": {"salt": "483"}, "desc": "A great, easy recipe. Jazzed it up a bit with some spices and cayenne in the potatoes, then cooked the tomatoes, salmon and asparagus all at the same time. Delicious!"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Steak & caramelised onion sandwich", "recipe_link": "http://www.bbcgoodfood.com/recipes/2228/steak-and-caramelised-onion-sandwich", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--2447_10.jpg?itok=OJ9Rqf8p", "author": "Good Food", "preparation": ["Put the grill on. Heat a little oil in a frying pan. Season both sides of the steaks with salt, then fry for 1-2 minutes on each side. Meanwhile, slice the ciabatta in half lengthways and grill the cut sides until golden.", "Drizzle the toasted ciabatta with olive oil, spread the bottom half with the onions and sit the steaks on top. Cover with the watercress and close the sandwich with the other half of the ciabatta. Cut into four sandwiches and serve two per person. Serve hot."], "nutrition": {}, "desc": "The classic snack gets an update - perfect for a Saturday night on, or during barbecue season"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Curry in a hurry", "recipe_link": "http://www.bbcgoodfood.com/recipes/1652/curry-in-a-hurry", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--1292_10.jpg?itok=_QPRc2Nd", "author": "Mary Cadogan", "preparation": ["Heat the oil in a pan, add onion and fry until they colour. Crush the garlic into the pan, add ginger and chilli; cook briefly. Add tomatoes and a quarter of a can of water and bring to the boil. Simmer for 2 mins, add prawns or chicken and gujarati masala, cover and cook for 2-3 mins for prawns and 5-6 mins for chicken.", "Reduce the heat to a simmer, then stir in the yogurt, a tablespoonful at time. Sprinkle with coriander and serve with warm garlic and coriander naans and a crisp salad of cucumber, shredded lettuce, sliced red onion and wedges of lemon."], "nutrition": {"salt": "195"}, "desc": "Curry needn't be a chore-like undertaking - here's a curry you can prepare in minutes"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Speedy prawn fried rice", "recipe_link": "http://www.bbcgoodfood.com/recipes/4499/speedy-prawn-fried-rice-", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--7355_12.jpg?itok=BLnAK18c", "author": "Good Food", "preparation": ["Heat the oil in a large wok. Add the red onion and vegetables, then stir-fry for 2 mins until starting to wilt. Throw in the prawns, garlic and fish sauce and cook everything together for 3-4 mins until the prawns change colour and cook through. (If using cooked prawns, you just need to stir them into the rice to warm through before serving.)", "Scatter in the rice, then carry on cooking for 3-4 mins until the rice is piping hot. Serve scattered with coriander and pass round the soy sauce bottle for those who want it."], "nutrition": {"fat": "249"}, "desc": "Perfect for a Monday night when the last thing you want to do is cook, this rice dish is both filling and healthy"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Speedy Moroccan meatballs", "recipe_link": "http://www.bbcgoodfood.com/recipes/2998/speedy-moroccan-meatballs", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--4316_12.jpg?itok=qBvXGYNZ", "author": "Good Food", "preparation": ["Heat the oil in a large deep frying pan, then fry the meatballs for 10 mins, turning occasionally until cooked through. Scoop out of the pan and set aside, then cook the onion for 5 mins, until softened.", "Add the dried apricots, cinnamon stick, tomatoes and half a can of water to the pan, then bring to the boil and simmer for 10 mins. Remove the cinnamon stick. Return the meatballs to the pan and coat well with the tomato sauce. Serve sprinkled with the almonds and coriander."], "nutrition": {}, "desc": "A great twist on meatballs for a quick and tasty supper"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Tomato & thyme cod", "recipe_link": "http://www.bbcgoodfood.com/recipes/5939/tomato-and-thyme-cod", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--192662_12.jpg?itok=hgOLX3c5", "author": "Good Food", "preparation": ["Heat the oil in a frying pan, add the onion, then fry for 5-8 mins until lightly browned. Stir in the tomatoes, sugar, thyme and soy, then bring to the boil.", "Simmer 5 mins, then slip the cod into the sauce. Cover and gently cook for 8-10 mins until the cod flakes easily. Serve with baked or steamed potatoes."], "nutrition": {"salt": "172"}, "desc": "Ready in 20 minutes and low fat, this fish dish is great for a Monday night when you'd rather be on the sofa than in the kitchen"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Lamb cutlets with lentil & feta salad", "recipe_link": "http://www.bbcgoodfood.com/recipes/5597/lamb-cutlets-with-lentil-and-feta-salad", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--411500_12.jpg?itok=wDzfpSz9", "author": "Good Food", "preparation": ["Cook peas in boiling water for 3-4 mins until just tender, then drain. Mix with the lentils, vinegar, sugar and mint, then crumble in the feta and season well.", "Heat a griddle pan, brush the cutlets with a little oil and season. Cook in the hot pan for 4 mins on each side until browned and the middle is pink. Divide the salad between four bowls, then top with a couple of cutlets per person."], "nutrition": {}, "desc": "Impressive looking, but simple to prepare, this lamb cutlet dish is perfect for a speedy mid-week supper party"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Squash & ricotta wraps with coriander salsa", "recipe_link": "http://www.bbcgoodfood.com/recipes/12277/squash-and-ricotta-wraps-with-coriander-salsa", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--48768_12.jpg?itok=UuwQXY6s", "author": "Emma Lewis", "preparation": ["Toss together the squash, cumin and 2 tbsp oil in a bowl and season well. Cook on a hot griddle for 3-5 mins on each side until lightly charred and soft.", "Mix together the chilli, coriander, lime zest and a squeeze of juice with the remaining tbsp oil to make a salsa. Toast the tortillas on the griddle for 30 secs on each side. Fold them in half, then halve again to make a pocket. Place some squash slices inside and dollop over some ricotta. Drizzle with the salsa and serve straight away."], "nutrition": {}, "desc": "The combination of sweet squash, creamy ricotta and a zingy salsa creates a flavour-packed supper"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Teriyaki mackerel with tangy cucumber salad", "recipe_link": "http://www.bbcgoodfood.com/recipes/12138/teriyaki-mackerel-with-tangy-cucumber-salad", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--48334_10.jpg?itok=xonjwzfk", "author": "Good Food", "preparation": ["Put the mackerel into a shallow dish, splash over the marinade and scatter with half the spring onions. Set aside. Put the rice into a pan, cover with a fingertip of water, season with salt, then bring to the boil. Turn down heat, stir, then cover and simmer for 10 mins until all of the water has disappeared. Take off the heat, cover and leave to steam for 5 mins.", "Mix the cucumber with the remaining onions, spinach leaves and beansprouts. Stir together the sugar and vinegar with some seasoning. Lift the fish out of the marinade and put onto 2 plates. Drizzle with more marinade from the dish, if you like. Spoon the rice alongside, then toss the salad with the dressing and serve."], "nutrition": {}, "desc": "Add a taste of Asia to your midweek meal with this healthy recipe"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Rice noodles with sundried tomatoes, Parmesan & basil", "recipe_link": "http://www.bbcgoodfood.com/recipes/10569/rice-noodles-with-sundried-tomatoes-parmesan-and-b", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--327757_10.jpg?itok=N-PmixIq", "author": "Good Food", "preparation": ["Prepare the noodles according to pack instructions, then drain. Heat the oil, then fry the tomatoes and garlic for 3 mins. Toss the noodles and most of the cheese and basil into the pan, season, then scatter over the remaining cheese and basil."], "nutrition": {"salt": "329"}, "desc": "A great gluten-free alternative to pasta. Look out for wheat-free soba noodles too"},
{"source_logo": "http://www.bbcgoodfood.com/sites/default/files/logo/goodfood_primary_cmyk_red_mboty.png", "source_name": "bbcgoodfood", "name": "Salsa chicken & cheese tortillas", "recipe_link": "http://www.bbcgoodfood.com/recipes/9787/salsa-chicken-and-cheese-tortillas", "ingredients": [], "source_link": "http://www.bbcgoodfood.com", "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--19637_11.jpg?itok=EA2pTIJf", "author": "Sara Buenfeld", "preparation": ["Spread 2 tbsp salsa onto each tortilla, then evenly top one of them with the beans, spring onion, chicken and cheddar. Scatter with coriander, if you have it. Sandwich with the other tortilla, then brush with oil.", "Heat a large non-stick frying pan, then cook the tortilla, oil-side down, for 4 mins. Carefully turn over with a palette knife (or by turning it out onto a plate, sliding it back into the pan), then cook for 2 mins on the other side until golden. Serve cut into wedges."], "nutrition": {}, "desc": "Frugal cooking, but packed with flavour - use up leftovers from roast chicken with these easy Mexican-style snacks"}